RT-Thread/rt-thread/bsp/hc32f460/Libraries/CMSIS/Device/HDSC/HC32F460/Include/hc32f460.h
typedef struct
{
    union
    {
        __IO uint32_t USBFS_GVBUSCFG;
        stc_usbfs_usbfs_gvbuscfg_field_t USBFS_GVBUSCFG_f;
    };
    uint8_t RESERVED1[4];
    union
    {
        __IO uint32_t GAHBCFG;
        stc_usbfs_gahbcfg_field_t GAHBCFG_f;
    };
    union
    {
        __IO uint32_t GUSBCFG;
        stc_usbfs_gusbcfg_field_t GUSBCFG_f;
    };
    union
    {
        __IO uint32_t GRSTCTL;
        stc_usbfs_grstctl_field_t GRSTCTL_f;
    };
    union
    {
        __IO uint32_t GINTSTS;
        stc_usbfs_gintsts_field_t GINTSTS_f;
    };
    union
    {
        __IO uint32_t GINTMSK;
        stc_usbfs_gintmsk_field_t GINTMSK_f;
    };
    union
    {
        __IO uint32_t GRXSTSR;
        stc_usbfs_grxstsr_field_t GRXSTSR_f;
    };
    union
    {
        __IO uint32_t GRXSTSP;
        stc_usbfs_grxstsp_field_t GRXSTSP_f;
    };
    union
    {
        __IO uint32_t GRXFSIZ;
        stc_usbfs_grxfsiz_field_t GRXFSIZ_f;
    };
    union
    {
        __IO uint32_t HNPTXFSIZ;
        stc_usbfs_hnptxfsiz_field_t HNPTXFSIZ_f;
    };
    union
    {
        __IO uint32_t HNPTXSTS;
        stc_usbfs_hnptxsts_field_t HNPTXSTS_f;
    };
    uint8_t RESERVED11[12];
    __IO uint32_t CID;
    uint8_t RESERVED12[192];
    union
    {
        __IO uint32_t HPTXFSIZ;
        stc_usbfs_hptxfsiz_field_t HPTXFSIZ_f;
    };
    union
    {
        __IO uint32_t DIEPTXF1;
        stc_usbfs_dieptxf_field_t DIEPTXF1_f;
    };
    union
    {
        __IO uint32_t DIEPTXF2;
        stc_usbfs_dieptxf_field_t DIEPTXF2_f;
    };
    union
    {
        __IO uint32_t DIEPTXF3;
        stc_usbfs_dieptxf_field_t DIEPTXF3_f;
    };
    union
    {
        __IO uint32_t DIEPTXF4;
        stc_usbfs_dieptxf_field_t DIEPTXF4_f;
    };
    union
    {
        __IO uint32_t DIEPTXF5;
        stc_usbfs_dieptxf_field_t DIEPTXF5_f;
    };
    uint8_t RESERVED18[744];
    union
    {
        __IO uint32_t HCFG;
        stc_usbfs_hcfg_field_t HCFG_f;
    };
    union
    {
        __IO uint32_t HFIR;
        stc_usbfs_hfir_field_t HFIR_f;
    };
    union
    {
        __IO uint32_t HFNUM;
        stc_usbfs_hfnum_field_t HFNUM_f;
    };
    uint8_t RESERVED21[4];
    union
    {
        __IO uint32_t HPTXSTS;
        stc_usbfs_hptxsts_field_t HPTXSTS_f;
    };
    union
    {
        __IO uint32_t HAINT;
        stc_usbfs_haint_field_t HAINT_f;
    };
    union
    {
        __IO uint32_t HAINTMSK;
        stc_usbfs_haintmsk_field_t HAINTMSK_f;
    };
    uint8_t RESERVED24[36];
    union
    {
        __IO uint32_t HPRT;
        stc_usbfs_hprt_field_t HPRT_f;
    };
    uint8_t RESERVED25[188];
    union
    {
        __IO uint32_t HCCHAR0;
        stc_usbfs_hcchar_field_t HCCHAR0_f;
    };
    uint8_t RESERVED26[4];
    union
    {
        __IO uint32_t HCINT0;
        stc_usbfs_hcint_field_t HCINT0_f;
    };
    union
    {
        __IO uint32_t HCINTMSK0;
        stc_usbfs_hcintmsk_field_t HCINTMSK0_f;
    };
    union
    {
        __IO uint32_t HCTSIZ0;
        stc_usbfs_hctsiz_field_t HCTSIZ0_f;
    };
    __IO uint32_t HCDMA0;
    uint8_t RESERVED30[8];
    union
    {
        __IO uint32_t HCCHAR1;
        stc_usbfs_hcchar_field_t HCCHAR1_f;
    };
    uint8_t RESERVED31[4];
    union
    {
        __IO uint32_t HCINT1;
        stc_usbfs_hcint_field_t HCINT1_f;
    };
    union
    {
        __IO uint32_t HCINTMSK1;
        stc_usbfs_hcintmsk_field_t HCINTMSK1_f;
    };
    union
    {
        __IO uint32_t HCTSIZ1;
        stc_usbfs_hctsiz_field_t HCTSIZ1_f;
    };
    __IO uint32_t HCDMA1;
    uint8_t RESERVED35[8];
    union
    {
        __IO uint32_t HCCHAR2;
        stc_usbfs_hcchar_field_t HCCHAR2_f;
    };
    uint8_t RESERVED36[4];
    union
    {
        __IO uint32_t HCINT2;
        stc_usbfs_hcint_field_t HCINT2_f;
    };
    union
    {
        __IO uint32_t HCINTMSK2;
        stc_usbfs_hcintmsk_field_t HCINTMSK2_f;
    };
    union
    {
        __IO uint32_t HCTSIZ2;
        stc_usbfs_hctsiz_field_t HCTSIZ2_f;
    };
    __IO uint32_t HCDMA2;
    uint8_t RESERVED40[8];
    union
    {
        __IO uint32_t HCCHAR3;
        stc_usbfs_hcchar_field_t HCCHAR3_f;
    };
    uint8_t RESERVED41[4];
    union
    {
        __IO uint32_t HCINT3;
        stc_usbfs_hcint_field_t HCINT3_f;
    };
    union
    {
        __IO uint32_t HCINTMSK3;
        stc_usbfs_hcintmsk_field_t HCINTMSK3_f;
    };
    union
    {
        __IO uint32_t HCTSIZ3;
        stc_usbfs_hctsiz_field_t HCTSIZ3_f;
    };
    __IO uint32_t HCDMA3;
    uint8_t RESERVED45[8];
    union
    {
        __IO uint32_t HCCHAR4;
        stc_usbfs_hcchar_field_t HCCHAR4_f;
    };
    uint8_t RESERVED46[4];
    union
    {
        __IO uint32_t HCINT4;
        stc_usbfs_hcint_field_t HCINT4_f;
    };
    union
    {
        __IO uint32_t HCINTMSK4;
        stc_usbfs_hcintmsk_field_t HCINTMSK4_f;
    };
    union
    {
        __IO uint32_t HCTSIZ4;
        stc_usbfs_hctsiz_field_t HCTSIZ4_f;
    };
    __IO uint32_t HCDMA4;
    uint8_t RESERVED50[8];
    union
    {
        __IO uint32_t HCCHAR5;
        stc_usbfs_hcchar_field_t HCCHAR5_f;
    };
    uint8_t RESERVED51[4];
    union
    {
        __IO uint32_t HCINT5;
        stc_usbfs_hcint_field_t HCINT5_f;
    };
    union
    {
        __IO uint32_t HCINTMSK5;
        stc_usbfs_hcintmsk_field_t HCINTMSK5_f;
    };
    union
    {
        __IO uint32_t HCTSIZ5;
        stc_usbfs_hctsiz_field_t HCTSIZ5_f;
    };
    __IO uint32_t HCDMA5;
    uint8_t RESERVED55[8];
    union
    {
        __IO uint32_t HCCHAR6;
        stc_usbfs_hcchar_field_t HCCHAR6_f;
    };
    uint8_t RESERVED56[4];
    union
    {
        __IO uint32_t HCINT6;
        stc_usbfs_hcint_field_t HCINT6_f;
    };
    union
    {
        __IO uint32_t HCINTMSK6;
        stc_usbfs_hcintmsk_field_t HCINTMSK6_f;
    };
    union
    {
        __IO uint32_t HCTSIZ6;
        stc_usbfs_hctsiz_field_t HCTSIZ6_f;
    };
    __IO uint32_t HCDMA6;
    uint8_t RESERVED60[8];
    union
    {
        __IO uint32_t HCCHAR7;
        stc_usbfs_hcchar_field_t HCCHAR7_f;
    };
    uint8_t RESERVED61[4];
    union
    {
        __IO uint32_t HCINT7;
        stc_usbfs_hcint_field_t HCINT7_f;
    };
    union
    {
        __IO uint32_t HCINTMSK7;
        stc_usbfs_hcintmsk_field_t HCINTMSK7_f;
    };
    union
    {
        __IO uint32_t HCTSIZ7;
        stc_usbfs_hctsiz_field_t HCTSIZ7_f;
    };
    __IO uint32_t HCDMA7;
    uint8_t RESERVED65[8];
    union
    {
        __IO uint32_t HCCHAR8;
        stc_usbfs_hcchar_field_t HCCHAR8_f;
    };
    uint8_t RESERVED66[4];
    union
    {
        __IO uint32_t HCINT8;
        stc_usbfs_hcint_field_t HCINT8_f;
    };
    union
    {
        __IO uint32_t HCINTMSK8;
        stc_usbfs_hcintmsk_field_t HCINTMSK8_f;
    };
    union
    {
        __IO uint32_t HCTSIZ8;
        stc_usbfs_hctsiz_field_t HCTSIZ8_f;
    };
    __IO uint32_t HCDMA8;
    uint8_t RESERVED70[8];
    union
    {
        __IO uint32_t HCCHAR9;
        stc_usbfs_hcchar_field_t HCCHAR9_f;
    };
    uint8_t RESERVED71[4];
    union
    {
        __IO uint32_t HCINT9;
        stc_usbfs_hcint_field_t HCINT9_f;
    };
    union
    {
        __IO uint32_t HCINTMSK9;
        stc_usbfs_hcintmsk_field_t HCINTMSK9_f;
    };
    union
    {
        __IO uint32_t HCTSIZ9;
        stc_usbfs_hctsiz_field_t HCTSIZ9_f;
    };
    __IO uint32_t HCDMA9;
    uint8_t RESERVED75[8];
    union
    {
        __IO uint32_t HCCHAR10;
        stc_usbfs_hcchar_field_t HCCHAR10_f;
    };
    uint8_t RESERVED76[4];
    union
    {
        __IO uint32_t HCINT10;
        stc_usbfs_hcint_field_t HCINT10_f;
    };
    union
    {
        __IO uint32_t HCINTMSK10;
        stc_usbfs_hcintmsk_field_t HCINTMSK10_f;
    };
    union
    {
        __IO uint32_t HCTSIZ10;
        stc_usbfs_hctsiz_field_t HCTSIZ10_f;
    };
    __IO uint32_t HCDMA10;
    uint8_t RESERVED80[8];
    union
    {
        __IO uint32_t HCCHAR11;
        stc_usbfs_hcchar_field_t HCCHAR11_f;
    };
    uint8_t RESERVED81[4];
    union
    {
        __IO uint32_t HCINT11;
        stc_usbfs_hcint_field_t HCINT11_f;
    };
    union
    {
        __IO uint32_t HCINTMSK11;
        stc_usbfs_hcintmsk_field_t HCINTMSK11_f;
    };
    union
    {
        __IO uint32_t HCTSIZ11;
        stc_usbfs_hctsiz_field_t HCTSIZ11_f;
    };
    __IO uint32_t HCDMA11;
    uint8_t RESERVED85[392];
    union
    {
        __IO uint32_t DCFG;
        stc_usbfs_dcfg_field_t DCFG_f;
    };
    union
    {
        __IO uint32_t DCTL;
        stc_usbfs_dctl_field_t DCTL_f;
    };
    union
    {
        __IO uint32_t DSTS;
        stc_usbfs_dsts_field_t DSTS_f;
    };
    uint8_t RESERVED88[4];
    union
    {
        __IO uint32_t DIEPMSK;
        stc_usbfs_diepmsk_field_t DIEPMSK_f;
    };
    union
    {
        __IO uint32_t DOEPMSK;
        stc_usbfs_doepmsk_field_t DOEPMSK_f;
    };
    union
    {
        __IO uint32_t DAINT;
        stc_usbfs_daint_field_t DAINT_f;
    };
    union
    {
        __IO uint32_t DAINTMSK;
        stc_usbfs_daintmsk_field_t DAINTMSK_f;
    };
    uint8_t RESERVED92[20];
    union
    {
        __IO uint32_t DIEPEMPMSK;
        stc_usbfs_diepempmsk_field_t DIEPEMPMSK_f;
    };
    uint8_t RESERVED93[200];
    union
    {
        __IO uint32_t DIEPCTL0;
        stc_usbfs_diepctl0_field_t DIEPCTL0_f;
    };
    uint8_t RESERVED94[4];
    union
    {
        __IO uint32_t DIEPINT0;
        stc_usbfs_diepint0_field_t DIEPINT0_f;
    };
    uint8_t RESERVED95[4];
    union
    {
        __IO uint32_t DIEPTSIZ0;
        stc_usbfs_dieptsiz0_field_t DIEPTSIZ0_f;
    };
    __IO uint32_t DIEPDMA0;
    union
    {
        __IO uint32_t DTXFSTS0;
        stc_usbfs_dtxfsts0_field_t DTXFSTS0_f;
    };
    uint8_t RESERVED98[4];
    union
    {
        __IO uint32_t DIEPCTL1;
        stc_usbfs_diepctl_field_t DIEPCTL1_f;
    };
    uint8_t RESERVED99[4];
    union
    {
        __IO uint32_t DIEPINT1;
        stc_usbfs_diepint_field_t DIEPINT1_f;
    };
    uint8_t RESERVED100[4];
    union
    {
        __IO uint32_t DIEPTSIZ1;
        stc_usbfs_dieptsiz_field_t DIEPTSIZ1_f;
    };
    __IO uint32_t DIEPDMA1;
    union
    {
        __IO uint32_t DTXFSTS1;
        stc_usbfs_dtxfsts_field_t DTXFSTS1_f;
    };
    uint8_t RESERVED103[4];
    union
    {
        __IO uint32_t DIEPCTL2;
        stc_usbfs_diepctl_field_t DIEPCTL2_f;
    };
    uint8_t RESERVED104[4];
    union
    {
        __IO uint32_t DIEPINT2;
        stc_usbfs_diepint_field_t DIEPINT2_f;
    };
    uint8_t RESERVED105[4];
    union
    {
        __IO uint32_t DIEPTSIZ2;
        stc_usbfs_dieptsiz_field_t DIEPTSIZ2_f;
    };
    __IO uint32_t DIEPDMA2;
    union
    {
        __IO uint32_t DTXFSTS2;
        stc_usbfs_dtxfsts_field_t DTXFSTS2_f;
    };
    uint8_t RESERVED108[4];
    union
    {
        __IO uint32_t DIEPCTL3;
        stc_usbfs_diepctl_field_t DIEPCTL3_f;
    };
    uint8_t RESERVED109[4];
    union
    {
        __IO uint32_t DIEPINT3;
        stc_usbfs_diepint_field_t DIEPINT3_f;
    };
    uint8_t RESERVED110[4];
    union
    {
        __IO uint32_t DIEPTSIZ3;
        stc_usbfs_dieptsiz_field_t DIEPTSIZ3_f;
    };
    __IO uint32_t DIEPDMA3;
    union
    {
        __IO uint32_t DTXFSTS3;
        stc_usbfs_dtxfsts_field_t DTXFSTS3_f;
    };
    uint8_t RESERVED113[4];
    union
    {
        __IO uint32_t DIEPCTL4;
        stc_usbfs_diepctl_field_t DIEPCTL4_f;
    };
    uint8_t RESERVED114[4];
    union
    {
        __IO uint32_t DIEPINT4;
        stc_usbfs_diepint_field_t DIEPINT4_f;
    };
    uint8_t RESERVED115[4];
    union
    {
        __IO uint32_t DIEPTSIZ4;
        stc_usbfs_dieptsiz_field_t DIEPTSIZ4_f;
    };
    __IO uint32_t DIEPDMA4;
    union
    {
        __IO uint32_t DTXFSTS4;
        stc_usbfs_dtxfsts_field_t DTXFSTS4_f;
    };
    uint8_t RESERVED118[4];
    union
    {
        __IO uint32_t DIEPCTL5;
        stc_usbfs_diepctl_field_t DIEPCTL5_f;
    };
    uint8_t RESERVED119[4];
    union
    {
        __IO uint32_t DIEPINT5;
        stc_usbfs_diepint_field_t DIEPINT5_f;
    };
    uint8_t RESERVED120[4];
    union
    {
        __IO uint32_t DIEPTSIZ5;
        stc_usbfs_dieptsiz_field_t DIEPTSIZ5_f;
    };
    __IO uint32_t DIEPDMA5;
    union
    {
        __IO uint32_t DTXFSTS5;
        stc_usbfs_dtxfsts_field_t DTXFSTS5_f;
    };
    uint8_t RESERVED123[324];
    union
    {
        __IO uint32_t DOEPCTL0;
        stc_usbfs_doepctl0_field_t DOEPCTL0_f;
    };
    uint8_t RESERVED124[4];
    union
    {
        __IO uint32_t DOEPINT0;
        stc_usbfs_doepint_field_t DOEPINT0_f;
    };
    uint8_t RESERVED125[4];
    union
    {
        __IO uint32_t DOEPTSIZ0;
        stc_usbfs_doeptsiz0_field_t DOEPTSIZ0_f;
    };
    __IO uint32_t DOEPDMA0;
    uint8_t RESERVED127[8];
    union
    {
        __IO uint32_t DOEPCTL1;
        stc_usbfs_doepctl_field_t DOEPCTL1_f;
    };
    uint8_t RESERVED128[4];
    union
    {
        __IO uint32_t DOEPINT1;
        stc_usbfs_doepint_field_t DOEPINT1_f;
    };
    uint8_t RESERVED129[4];
    union
    {
        __IO uint32_t DOEPTSIZ1;
        stc_usbfs_doeptsiz_field_t DOEPTSIZ1_f;
    };
    __IO uint32_t DOEPDMA1;
    uint8_t RESERVED131[8];
    union
    {
        __IO uint32_t DOEPCTL2;
        stc_usbfs_doepctl_field_t DOEPCTL2_f;
    };
    uint8_t RESERVED132[4];
    union
    {
        __IO uint32_t DOEPINT2;
        stc_usbfs_doepint_field_t DOEPINT2_f;
    };
    uint8_t RESERVED133[4];
    union
    {
        __IO uint32_t DOEPTSIZ2;
        stc_usbfs_doeptsiz_field_t DOEPTSIZ2_f;
    };
    __IO uint32_t DOEPDMA2;
    uint8_t RESERVED135[8];
    union
    {
        __IO uint32_t DOEPCTL3;
        stc_usbfs_doepctl_field_t DOEPCTL3_f;
    };
    uint8_t RESERVED136[4];
    union
    {
        __IO uint32_t DOEPINT3;
        stc_usbfs_doepint_field_t DOEPINT3_f;
    };
    uint8_t RESERVED137[4];
    union
    {
        __IO uint32_t DOEPTSIZ3;
        stc_usbfs_doeptsiz_field_t DOEPTSIZ3_f;
    };
    __IO uint32_t DOEPDMA3;
    uint8_t RESERVED139[8];
    union
    {
        __IO uint32_t DOEPCTL4;
        stc_usbfs_doepctl_field_t DOEPCTL4_f;
    };
    uint8_t RESERVED140[4];
    union
    {
        __IO uint32_t DOEPINT4;
        stc_usbfs_doepint_field_t DOEPINT4_f;
    };
    uint8_t RESERVED141[4];
    union
    {
        __IO uint32_t DOEPTSIZ4;
        stc_usbfs_doeptsiz_field_t DOEPTSIZ4_f;
    };
    __IO uint32_t DOEPDMA4;
    uint8_t RESERVED143[8];
    union
    {
        __IO uint32_t DOEPCTL5;
        stc_usbfs_doepctl_field_t DOEPCTL5_f;
    };
    uint8_t RESERVED144[4];
    union
    {
        __IO uint32_t DOEPINT5;
        stc_usbfs_doepint_field_t DOEPINT5_f;
    };
    uint8_t RESERVED145[4];
    union
    {
        __IO uint32_t DOEPTSIZ5;
        stc_usbfs_doeptsiz_field_t DOEPTSIZ5_f;
    };
    __IO uint32_t DOEPDMA5;
    uint8_t RESERVED147[584];
    union
    {
        __IO uint32_t PCGCCTL;
        stc_usbfs_pcgcctl_field_t PCGCCTL_f;
    };
}M4_USBFS_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_wdt_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t SR;
        stc_wdt_sr_field_t SR_f;
    };
    union
    {
        __IO uint32_t RR;
        stc_wdt_rr_field_t RR_f;
    };
}M4_WDT_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CR;
        stc_wktm_cr_field_t CR_f;
    };
}M4_WKTM_TypeDef;



#define M4_ADC1                                 ((M4_ADC_TypeDef *)0x40040000UL)
#define M4_ADC2                                 ((M4_ADC_TypeDef *)0x40040400UL)
#define M4_AES                                  ((M4_AES_TypeDef *)0x40008000UL)
#define M4_AOS                                  ((M4_AOS_TypeDef *)0x40010800UL)
#define M4_CAN                                  ((M4_CAN_TypeDef *)0x40070400UL)
#define M4_CMP1                                 ((M4_CMP_TypeDef *)0x4004A000UL)
#define M4_CMP2                                 ((M4_CMP_TypeDef *)0x4004A010UL)
#define M4_CMP3                                 ((M4_CMP_TypeDef *)0x4004A020UL)
#define M4_CMP_CR                               ((M4_CMP_CR_TypeDef *)0x4004A000UL)
#define M4_CRC                                  ((M4_CRC_TypeDef *)0x40008C00UL)
#define M4_DBGC                                 ((M4_DBGC_TypeDef *)0xE0042000UL)
#define M4_DCU1                                 ((M4_DCU_TypeDef *)0x40052000UL)
#define M4_DCU2                                 ((M4_DCU_TypeDef *)0x40052400UL)
#define M4_DCU3                                 ((M4_DCU_TypeDef *)0x40052800UL)
#define M4_DCU4                                 ((M4_DCU_TypeDef *)0x40052C00UL)
#define M4_DMA1                                 ((M4_DMA_TypeDef *)0x40053000UL)
#define M4_DMA2                                 ((M4_DMA_TypeDef *)0x40053400UL)
#define M4_EFM                                  ((M4_EFM_TypeDef *)0x40010400UL)
#define M4_EMB1                                 ((M4_EMB_TypeDef *)0x40017C00UL)
#define M4_EMB2                                 ((M4_EMB_TypeDef *)0x40017C20UL)
#define M4_EMB3                                 ((M4_EMB_TypeDef *)0x40017C40UL)
#define M4_EMB4                                 ((M4_EMB_TypeDef *)0x40017C60UL)
#define M4_FCM                                  ((M4_FCM_TypeDef *)0x40048400UL)
#define M4_HASH                                 ((M4_HASH_TypeDef *)0x40008400UL)
#define M4_I2C1                                 ((M4_I2C_TypeDef *)0x4004E000UL)
#define M4_I2C2                                 ((M4_I2C_TypeDef *)0x4004E400UL)
#define M4_I2C3                                 ((M4_I2C_TypeDef *)0x4004E800UL)
#define M4_I2S1                                 ((M4_I2S_TypeDef *)0x4001E000UL)
#define M4_I2S2                                 ((M4_I2S_TypeDef *)0x4001E400UL)
#define M4_I2S3                                 ((M4_I2S_TypeDef *)0x40022000UL)
#define M4_I2S4                                 ((M4_I2S_TypeDef *)0x40022400UL)
#define M4_ICG                                  ((M4_ICG_TypeDef *)0x00000400UL)
#define M4_INTC                                 ((M4_INTC_TypeDef *)0x40051000UL)
#define M4_KEYSCAN                              ((M4_KEYSCAN_TypeDef *)0x40050C00UL)
#define M4_MPU                                  ((M4_MPU_TypeDef *)0x40050000UL)
#define M4_MSTP                                 ((M4_MSTP_TypeDef *)0x40048000UL)
#define M4_OTS                                  ((M4_OTS_TypeDef *)0x4004A400UL)
#define M4_PERIC                                ((M4_PERIC_TypeDef *)0x40055400UL)
#define M4_PORT                                 ((M4_PORT_TypeDef *)0x40053800UL)
#define M4_QSPI                                 ((M4_QSPI_TypeDef *)0x9C000000UL)
#define M4_RTC                                  ((M4_RTC_TypeDef *)0x4004C000UL)
#define M4_SDIOC1                               ((M4_SDIOC_TypeDef *)0x4006FC00UL)
#define M4_SDIOC2                               ((M4_SDIOC_TypeDef *)0x40070000UL)
#define M4_SPI1                                 ((M4_SPI_TypeDef *)0x4001C000UL)
#define M4_SPI2                                 ((M4_SPI_TypeDef *)0x4001C400UL)
#define M4_SPI3                                 ((M4_SPI_TypeDef *)0x40020000UL)
#define M4_SPI4                                 ((M4_SPI_TypeDef *)0x40020400UL)
#define M4_SRAMC                                ((M4_SRAMC_TypeDef *)0x40050800UL)
#define M4_SWDT                                 ((M4_SWDT_TypeDef *)0x40049400UL)
#define M4_SYSREG                               ((M4_SYSREG_TypeDef *)0x40054000UL)
#define M4_TMR01                                ((M4_TMR0_TypeDef *)0x40024000UL)
#define M4_TMR02                                ((M4_TMR0_TypeDef *)0x40024400UL)
#define M4_TMR41                                ((M4_TMR4_TypeDef *)0x40017000UL)
#define M4_TMR42                                ((M4_TMR4_TypeDef *)0x40024800UL)
#define M4_TMR43                                ((M4_TMR4_TypeDef *)0x40024C00UL)
#define M4_TMR4_CR                              ((M4_TMR4_CR_TypeDef *)0x40055408UL)
#define M4_TMR61                                ((M4_TMR6_TypeDef *)0x40018000UL)
#define M4_TMR62                                ((M4_TMR6_TypeDef *)0x40018400UL)
#define M4_TMR63                                ((M4_TMR6_TypeDef *)0x40018800UL)
#define M4_TMR6_CR                              ((M4_TMR6_CR_TypeDef *)0x40018000UL)
#define M4_TMRA1                                ((M4_TMRA_TypeDef *)0x40015000UL)
#define M4_TMRA2                                ((M4_TMRA_TypeDef *)0x40015400UL)
#define M4_TMRA3                                ((M4_TMRA_TypeDef *)0x40015800UL)
#define M4_TMRA4                                ((M4_TMRA_TypeDef *)0x40015C00UL)
#define M4_TMRA5                                ((M4_TMRA_TypeDef *)0x40016000UL)
#define M4_TMRA6                                ((M4_TMRA_TypeDef *)0x40016400UL)
#define M4_TRNG                                 ((M4_TRNG_TypeDef *)0x40041000UL)
#define M4_USART1                               ((M4_USART_TypeDef *)0x4001D000UL)
#define M4_USART2                               ((M4_USART_TypeDef *)0x4001D400UL)
#define M4_USART3                               ((M4_USART_TypeDef *)0x40021000UL)
#define M4_USART4                               ((M4_USART_TypeDef *)0x40021400UL)
#define M4_USBFS                                ((M4_USBFS_TypeDef *)0x400C0000UL)
#define M4_WDT                                  ((M4_WDT_TypeDef *)0x40049000UL)
#define M4_WKTM                                 ((M4_WKTM_TypeDef *)0x4004C400UL)


