RT-Thread/rt-thread/bsp/hc32f460/Libraries/CMSIS/Device/HDSC/HC32F460/Include/hc32f460.h
#define bM4_DMA1_DNSEQCTL1_DOFFSET10              (*((volatile unsigned int*)(0x42A612A8UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET11              (*((volatile unsigned int*)(0x42A612ACUL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET12              (*((volatile unsigned int*)(0x42A612B0UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET13              (*((volatile unsigned int*)(0x42A612B4UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET14              (*((volatile unsigned int*)(0x42A612B8UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET15              (*((volatile unsigned int*)(0x42A612BCUL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET16              (*((volatile unsigned int*)(0x42A612C0UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET17              (*((volatile unsigned int*)(0x42A612C4UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET18              (*((volatile unsigned int*)(0x42A612C8UL)))
#define bM4_DMA1_DNSEQCTL1_DOFFSET19              (*((volatile unsigned int*)(0x42A612CCUL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT0                (*((volatile unsigned int*)(0x42A612D0UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT1                (*((volatile unsigned int*)(0x42A612D4UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT2                (*((volatile unsigned int*)(0x42A612D8UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT3                (*((volatile unsigned int*)(0x42A612DCUL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT4                (*((volatile unsigned int*)(0x42A612E0UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT5                (*((volatile unsigned int*)(0x42A612E4UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT6                (*((volatile unsigned int*)(0x42A612E8UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT7                (*((volatile unsigned int*)(0x42A612ECUL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT8                (*((volatile unsigned int*)(0x42A612F0UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT9                (*((volatile unsigned int*)(0x42A612F4UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT10               (*((volatile unsigned int*)(0x42A612F8UL)))
#define bM4_DMA1_DNSEQCTL1_DNSCNT11               (*((volatile unsigned int*)(0x42A612FCUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST0              (*((volatile unsigned int*)(0x42A61280UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST1              (*((volatile unsigned int*)(0x42A61284UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST2              (*((volatile unsigned int*)(0x42A61288UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST3              (*((volatile unsigned int*)(0x42A6128CUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST4              (*((volatile unsigned int*)(0x42A61290UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST5              (*((volatile unsigned int*)(0x42A61294UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST6              (*((volatile unsigned int*)(0x42A61298UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST7              (*((volatile unsigned int*)(0x42A6129CUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST8              (*((volatile unsigned int*)(0x42A612A0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST9              (*((volatile unsigned int*)(0x42A612A4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST10             (*((volatile unsigned int*)(0x42A612A8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST11             (*((volatile unsigned int*)(0x42A612ACUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST12             (*((volatile unsigned int*)(0x42A612B0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST13             (*((volatile unsigned int*)(0x42A612B4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST14             (*((volatile unsigned int*)(0x42A612B8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST15             (*((volatile unsigned int*)(0x42A612BCUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST16             (*((volatile unsigned int*)(0x42A612C0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST17             (*((volatile unsigned int*)(0x42A612C4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST18             (*((volatile unsigned int*)(0x42A612C8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSDIST19             (*((volatile unsigned int*)(0x42A612CCUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB0              (*((volatile unsigned int*)(0x42A612D0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB1              (*((volatile unsigned int*)(0x42A612D4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB2              (*((volatile unsigned int*)(0x42A612D8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB3              (*((volatile unsigned int*)(0x42A612DCUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB4              (*((volatile unsigned int*)(0x42A612E0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB5              (*((volatile unsigned int*)(0x42A612E4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB6              (*((volatile unsigned int*)(0x42A612E8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB7              (*((volatile unsigned int*)(0x42A612ECUL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB8              (*((volatile unsigned int*)(0x42A612F0UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB9              (*((volatile unsigned int*)(0x42A612F4UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB10             (*((volatile unsigned int*)(0x42A612F8UL)))
#define bM4_DMA1_DNSEQCTLB1_DNSCNTB11             (*((volatile unsigned int*)(0x42A612FCUL)))
#define bM4_DMA1_LLP1_LLP0                        (*((volatile unsigned int*)(0x42A61308UL)))
#define bM4_DMA1_LLP1_LLP1                        (*((volatile unsigned int*)(0x42A6130CUL)))
#define bM4_DMA1_LLP1_LLP2                        (*((volatile unsigned int*)(0x42A61310UL)))
#define bM4_DMA1_LLP1_LLP3                        (*((volatile unsigned int*)(0x42A61314UL)))
#define bM4_DMA1_LLP1_LLP4                        (*((volatile unsigned int*)(0x42A61318UL)))
#define bM4_DMA1_LLP1_LLP5                        (*((volatile unsigned int*)(0x42A6131CUL)))
#define bM4_DMA1_LLP1_LLP6                        (*((volatile unsigned int*)(0x42A61320UL)))
#define bM4_DMA1_LLP1_LLP7                        (*((volatile unsigned int*)(0x42A61324UL)))
#define bM4_DMA1_LLP1_LLP8                        (*((volatile unsigned int*)(0x42A61328UL)))
#define bM4_DMA1_LLP1_LLP9                        (*((volatile unsigned int*)(0x42A6132CUL)))
#define bM4_DMA1_LLP1_LLP10                       (*((volatile unsigned int*)(0x42A61330UL)))
#define bM4_DMA1_LLP1_LLP11                       (*((volatile unsigned int*)(0x42A61334UL)))
#define bM4_DMA1_LLP1_LLP12                       (*((volatile unsigned int*)(0x42A61338UL)))
#define bM4_DMA1_LLP1_LLP13                       (*((volatile unsigned int*)(0x42A6133CUL)))
#define bM4_DMA1_LLP1_LLP14                       (*((volatile unsigned int*)(0x42A61340UL)))
#define bM4_DMA1_LLP1_LLP15                       (*((volatile unsigned int*)(0x42A61344UL)))
#define bM4_DMA1_LLP1_LLP16                       (*((volatile unsigned int*)(0x42A61348UL)))
#define bM4_DMA1_LLP1_LLP17                       (*((volatile unsigned int*)(0x42A6134CUL)))
#define bM4_DMA1_LLP1_LLP18                       (*((volatile unsigned int*)(0x42A61350UL)))
#define bM4_DMA1_LLP1_LLP19                       (*((volatile unsigned int*)(0x42A61354UL)))
#define bM4_DMA1_LLP1_LLP20                       (*((volatile unsigned int*)(0x42A61358UL)))
#define bM4_DMA1_LLP1_LLP21                       (*((volatile unsigned int*)(0x42A6135CUL)))
#define bM4_DMA1_LLP1_LLP22                       (*((volatile unsigned int*)(0x42A61360UL)))
#define bM4_DMA1_LLP1_LLP23                       (*((volatile unsigned int*)(0x42A61364UL)))
#define bM4_DMA1_LLP1_LLP24                       (*((volatile unsigned int*)(0x42A61368UL)))
#define bM4_DMA1_LLP1_LLP25                       (*((volatile unsigned int*)(0x42A6136CUL)))
#define bM4_DMA1_LLP1_LLP26                       (*((volatile unsigned int*)(0x42A61370UL)))
#define bM4_DMA1_LLP1_LLP27                       (*((volatile unsigned int*)(0x42A61374UL)))
#define bM4_DMA1_LLP1_LLP28                       (*((volatile unsigned int*)(0x42A61378UL)))
#define bM4_DMA1_LLP1_LLP29                       (*((volatile unsigned int*)(0x42A6137CUL)))
#define bM4_DMA1_CH1CTL_SINC0                     (*((volatile unsigned int*)(0x42A61380UL)))
#define bM4_DMA1_CH1CTL_SINC1                     (*((volatile unsigned int*)(0x42A61384UL)))
#define bM4_DMA1_CH1CTL_DINC0                     (*((volatile unsigned int*)(0x42A61388UL)))
#define bM4_DMA1_CH1CTL_DINC1                     (*((volatile unsigned int*)(0x42A6138CUL)))
#define bM4_DMA1_CH1CTL_SRPTEN                    (*((volatile unsigned int*)(0x42A61390UL)))
#define bM4_DMA1_CH1CTL_DRPTEN                    (*((volatile unsigned int*)(0x42A61394UL)))
#define bM4_DMA1_CH1CTL_SNSEQEN                   (*((volatile unsigned int*)(0x42A61398UL)))
#define bM4_DMA1_CH1CTL_DNSEQEN                   (*((volatile unsigned int*)(0x42A6139CUL)))
#define bM4_DMA1_CH1CTL_HSIZE0                    (*((volatile unsigned int*)(0x42A613A0UL)))
#define bM4_DMA1_CH1CTL_HSIZE1                    (*((volatile unsigned int*)(0x42A613A4UL)))
#define bM4_DMA1_CH1CTL_LLPEN                     (*((volatile unsigned int*)(0x42A613A8UL)))
#define bM4_DMA1_CH1CTL_LLPRUN                    (*((volatile unsigned int*)(0x42A613ACUL)))
#define bM4_DMA1_CH1CTL_IE                        (*((volatile unsigned int*)(0x42A613B0UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE0               (*((volatile unsigned int*)(0x42A61500UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE1               (*((volatile unsigned int*)(0x42A61504UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE2               (*((volatile unsigned int*)(0x42A61508UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE3               (*((volatile unsigned int*)(0x42A6150CUL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE4               (*((volatile unsigned int*)(0x42A61510UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE5               (*((volatile unsigned int*)(0x42A61514UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE6               (*((volatile unsigned int*)(0x42A61518UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE7               (*((volatile unsigned int*)(0x42A6151CUL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE8               (*((volatile unsigned int*)(0x42A61520UL)))
#define bM4_DMA1_MONDTCTL1_BLKSIZE9               (*((volatile unsigned int*)(0x42A61524UL)))
#define bM4_DMA1_MONDTCTL1_CNT0                   (*((volatile unsigned int*)(0x42A61540UL)))
#define bM4_DMA1_MONDTCTL1_CNT1                   (*((volatile unsigned int*)(0x42A61544UL)))
#define bM4_DMA1_MONDTCTL1_CNT2                   (*((volatile unsigned int*)(0x42A61548UL)))
#define bM4_DMA1_MONDTCTL1_CNT3                   (*((volatile unsigned int*)(0x42A6154CUL)))
#define bM4_DMA1_MONDTCTL1_CNT4                   (*((volatile unsigned int*)(0x42A61550UL)))
#define bM4_DMA1_MONDTCTL1_CNT5                   (*((volatile unsigned int*)(0x42A61554UL)))
#define bM4_DMA1_MONDTCTL1_CNT6                   (*((volatile unsigned int*)(0x42A61558UL)))
#define bM4_DMA1_MONDTCTL1_CNT7                   (*((volatile unsigned int*)(0x42A6155CUL)))
#define bM4_DMA1_MONDTCTL1_CNT8                   (*((volatile unsigned int*)(0x42A61560UL)))
#define bM4_DMA1_MONDTCTL1_CNT9                   (*((volatile unsigned int*)(0x42A61564UL)))
#define bM4_DMA1_MONDTCTL1_CNT10                  (*((volatile unsigned int*)(0x42A61568UL)))
#define bM4_DMA1_MONDTCTL1_CNT11                  (*((volatile unsigned int*)(0x42A6156CUL)))
#define bM4_DMA1_MONDTCTL1_CNT12                  (*((volatile unsigned int*)(0x42A61570UL)))
#define bM4_DMA1_MONDTCTL1_CNT13                  (*((volatile unsigned int*)(0x42A61574UL)))
#define bM4_DMA1_MONDTCTL1_CNT14                  (*((volatile unsigned int*)(0x42A61578UL)))
#define bM4_DMA1_MONDTCTL1_CNT15                  (*((volatile unsigned int*)(0x42A6157CUL)))
#define bM4_DMA1_MONRPT1_SRPT0                    (*((volatile unsigned int*)(0x42A61580UL)))
#define bM4_DMA1_MONRPT1_SRPT1                    (*((volatile unsigned int*)(0x42A61584UL)))
#define bM4_DMA1_MONRPT1_SRPT2                    (*((volatile unsigned int*)(0x42A61588UL)))
#define bM4_DMA1_MONRPT1_SRPT3                    (*((volatile unsigned int*)(0x42A6158CUL)))
#define bM4_DMA1_MONRPT1_SRPT4                    (*((volatile unsigned int*)(0x42A61590UL)))
#define bM4_DMA1_MONRPT1_SRPT5                    (*((volatile unsigned int*)(0x42A61594UL)))
#define bM4_DMA1_MONRPT1_SRPT6                    (*((volatile unsigned int*)(0x42A61598UL)))
#define bM4_DMA1_MONRPT1_SRPT7                    (*((volatile unsigned int*)(0x42A6159CUL)))
#define bM4_DMA1_MONRPT1_SRPT8                    (*((volatile unsigned int*)(0x42A615A0UL)))
#define bM4_DMA1_MONRPT1_SRPT9                    (*((volatile unsigned int*)(0x42A615A4UL)))
#define bM4_DMA1_MONRPT1_DRPT0                    (*((volatile unsigned int*)(0x42A615C0UL)))
#define bM4_DMA1_MONRPT1_DRPT1                    (*((volatile unsigned int*)(0x42A615C4UL)))
#define bM4_DMA1_MONRPT1_DRPT2                    (*((volatile unsigned int*)(0x42A615C8UL)))
#define bM4_DMA1_MONRPT1_DRPT3                    (*((volatile unsigned int*)(0x42A615CCUL)))
#define bM4_DMA1_MONRPT1_DRPT4                    (*((volatile unsigned int*)(0x42A615D0UL)))
#define bM4_DMA1_MONRPT1_DRPT5                    (*((volatile unsigned int*)(0x42A615D4UL)))
#define bM4_DMA1_MONRPT1_DRPT6                    (*((volatile unsigned int*)(0x42A615D8UL)))
#define bM4_DMA1_MONRPT1_DRPT7                    (*((volatile unsigned int*)(0x42A615DCUL)))
#define bM4_DMA1_MONRPT1_DRPT8                    (*((volatile unsigned int*)(0x42A615E0UL)))
#define bM4_DMA1_MONRPT1_DRPT9                    (*((volatile unsigned int*)(0x42A615E4UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET0            (*((volatile unsigned int*)(0x42A61600UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET1            (*((volatile unsigned int*)(0x42A61604UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET2            (*((volatile unsigned int*)(0x42A61608UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET3            (*((volatile unsigned int*)(0x42A6160CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET4            (*((volatile unsigned int*)(0x42A61610UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET5            (*((volatile unsigned int*)(0x42A61614UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET6            (*((volatile unsigned int*)(0x42A61618UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET7            (*((volatile unsigned int*)(0x42A6161CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET8            (*((volatile unsigned int*)(0x42A61620UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET9            (*((volatile unsigned int*)(0x42A61624UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET10           (*((volatile unsigned int*)(0x42A61628UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET11           (*((volatile unsigned int*)(0x42A6162CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET12           (*((volatile unsigned int*)(0x42A61630UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET13           (*((volatile unsigned int*)(0x42A61634UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET14           (*((volatile unsigned int*)(0x42A61638UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET15           (*((volatile unsigned int*)(0x42A6163CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET16           (*((volatile unsigned int*)(0x42A61640UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET17           (*((volatile unsigned int*)(0x42A61644UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET18           (*((volatile unsigned int*)(0x42A61648UL)))
#define bM4_DMA1_MONSNSEQCTL1_SOFFSET19           (*((volatile unsigned int*)(0x42A6164CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT0             (*((volatile unsigned int*)(0x42A61650UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT1             (*((volatile unsigned int*)(0x42A61654UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT2             (*((volatile unsigned int*)(0x42A61658UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT3             (*((volatile unsigned int*)(0x42A6165CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT4             (*((volatile unsigned int*)(0x42A61660UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT5             (*((volatile unsigned int*)(0x42A61664UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT6             (*((volatile unsigned int*)(0x42A61668UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT7             (*((volatile unsigned int*)(0x42A6166CUL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT8             (*((volatile unsigned int*)(0x42A61670UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT9             (*((volatile unsigned int*)(0x42A61674UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT10            (*((volatile unsigned int*)(0x42A61678UL)))
#define bM4_DMA1_MONSNSEQCTL1_SNSCNT11            (*((volatile unsigned int*)(0x42A6167CUL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET0            (*((volatile unsigned int*)(0x42A61680UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET1            (*((volatile unsigned int*)(0x42A61684UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET2            (*((volatile unsigned int*)(0x42A61688UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET3            (*((volatile unsigned int*)(0x42A6168CUL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET4            (*((volatile unsigned int*)(0x42A61690UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET5            (*((volatile unsigned int*)(0x42A61694UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET6            (*((volatile unsigned int*)(0x42A61698UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET7            (*((volatile unsigned int*)(0x42A6169CUL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET8            (*((volatile unsigned int*)(0x42A616A0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET9            (*((volatile unsigned int*)(0x42A616A4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET10           (*((volatile unsigned int*)(0x42A616A8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET11           (*((volatile unsigned int*)(0x42A616ACUL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET12           (*((volatile unsigned int*)(0x42A616B0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET13           (*((volatile unsigned int*)(0x42A616B4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET14           (*((volatile unsigned int*)(0x42A616B8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET15           (*((volatile unsigned int*)(0x42A616BCUL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET16           (*((volatile unsigned int*)(0x42A616C0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET17           (*((volatile unsigned int*)(0x42A616C4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET18           (*((volatile unsigned int*)(0x42A616C8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DOFFSET19           (*((volatile unsigned int*)(0x42A616CCUL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT0             (*((volatile unsigned int*)(0x42A616D0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT1             (*((volatile unsigned int*)(0x42A616D4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT2             (*((volatile unsigned int*)(0x42A616D8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT3             (*((volatile unsigned int*)(0x42A616DCUL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT4             (*((volatile unsigned int*)(0x42A616E0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT5             (*((volatile unsigned int*)(0x42A616E4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT6             (*((volatile unsigned int*)(0x42A616E8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT7             (*((volatile unsigned int*)(0x42A616ECUL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT8             (*((volatile unsigned int*)(0x42A616F0UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT9             (*((volatile unsigned int*)(0x42A616F4UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT10            (*((volatile unsigned int*)(0x42A616F8UL)))
#define bM4_DMA1_MONDNSEQCTL1_DNSCNT11            (*((volatile unsigned int*)(0x42A616FCUL)))
#define bM4_DMA1_DTCTL2_BLKSIZE0                  (*((volatile unsigned int*)(0x42A61900UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE1                  (*((volatile unsigned int*)(0x42A61904UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE2                  (*((volatile unsigned int*)(0x42A61908UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE3                  (*((volatile unsigned int*)(0x42A6190CUL)))
#define bM4_DMA1_DTCTL2_BLKSIZE4                  (*((volatile unsigned int*)(0x42A61910UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE5                  (*((volatile unsigned int*)(0x42A61914UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE6                  (*((volatile unsigned int*)(0x42A61918UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE7                  (*((volatile unsigned int*)(0x42A6191CUL)))
#define bM4_DMA1_DTCTL2_BLKSIZE8                  (*((volatile unsigned int*)(0x42A61920UL)))
#define bM4_DMA1_DTCTL2_BLKSIZE9                  (*((volatile unsigned int*)(0x42A61924UL)))
#define bM4_DMA1_DTCTL2_CNT0                      (*((volatile unsigned int*)(0x42A61940UL)))
#define bM4_DMA1_DTCTL2_CNT1                      (*((volatile unsigned int*)(0x42A61944UL)))
#define bM4_DMA1_DTCTL2_CNT2                      (*((volatile unsigned int*)(0x42A61948UL)))
#define bM4_DMA1_DTCTL2_CNT3                      (*((volatile unsigned int*)(0x42A6194CUL)))
#define bM4_DMA1_DTCTL2_CNT4                      (*((volatile unsigned int*)(0x42A61950UL)))
#define bM4_DMA1_DTCTL2_CNT5                      (*((volatile unsigned int*)(0x42A61954UL)))
#define bM4_DMA1_DTCTL2_CNT6                      (*((volatile unsigned int*)(0x42A61958UL)))
#define bM4_DMA1_DTCTL2_CNT7                      (*((volatile unsigned int*)(0x42A6195CUL)))
#define bM4_DMA1_DTCTL2_CNT8                      (*((volatile unsigned int*)(0x42A61960UL)))
#define bM4_DMA1_DTCTL2_CNT9                      (*((volatile unsigned int*)(0x42A61964UL)))
#define bM4_DMA1_DTCTL2_CNT10                     (*((volatile unsigned int*)(0x42A61968UL)))
#define bM4_DMA1_DTCTL2_CNT11                     (*((volatile unsigned int*)(0x42A6196CUL)))
#define bM4_DMA1_DTCTL2_CNT12                     (*((volatile unsigned int*)(0x42A61970UL)))
#define bM4_DMA1_DTCTL2_CNT13                     (*((volatile unsigned int*)(0x42A61974UL)))
#define bM4_DMA1_DTCTL2_CNT14                     (*((volatile unsigned int*)(0x42A61978UL)))
#define bM4_DMA1_DTCTL2_CNT15                     (*((volatile unsigned int*)(0x42A6197CUL)))
#define bM4_DMA1_RPT2_SRPT0                       (*((volatile unsigned int*)(0x42A61980UL)))
#define bM4_DMA1_RPT2_SRPT1                       (*((volatile unsigned int*)(0x42A61984UL)))
#define bM4_DMA1_RPT2_SRPT2                       (*((volatile unsigned int*)(0x42A61988UL)))
#define bM4_DMA1_RPT2_SRPT3                       (*((volatile unsigned int*)(0x42A6198CUL)))
#define bM4_DMA1_RPT2_SRPT4                       (*((volatile unsigned int*)(0x42A61990UL)))
#define bM4_DMA1_RPT2_SRPT5                       (*((volatile unsigned int*)(0x42A61994UL)))
#define bM4_DMA1_RPT2_SRPT6                       (*((volatile unsigned int*)(0x42A61998UL)))
#define bM4_DMA1_RPT2_SRPT7                       (*((volatile unsigned int*)(0x42A6199CUL)))
#define bM4_DMA1_RPT2_SRPT8                       (*((volatile unsigned int*)(0x42A619A0UL)))
#define bM4_DMA1_RPT2_SRPT9                       (*((volatile unsigned int*)(0x42A619A4UL)))
#define bM4_DMA1_RPT2_DRPT0                       (*((volatile unsigned int*)(0x42A619C0UL)))
#define bM4_DMA1_RPT2_DRPT1                       (*((volatile unsigned int*)(0x42A619C4UL)))
#define bM4_DMA1_RPT2_DRPT2                       (*((volatile unsigned int*)(0x42A619C8UL)))
#define bM4_DMA1_RPT2_DRPT3                       (*((volatile unsigned int*)(0x42A619CCUL)))
#define bM4_DMA1_RPT2_DRPT4                       (*((volatile unsigned int*)(0x42A619D0UL)))
#define bM4_DMA1_RPT2_DRPT5                       (*((volatile unsigned int*)(0x42A619D4UL)))
#define bM4_DMA1_RPT2_DRPT6                       (*((volatile unsigned int*)(0x42A619D8UL)))
#define bM4_DMA1_RPT2_DRPT7                       (*((volatile unsigned int*)(0x42A619DCUL)))
#define bM4_DMA1_RPT2_DRPT8                       (*((volatile unsigned int*)(0x42A619E0UL)))
#define bM4_DMA1_RPT2_DRPT9                       (*((volatile unsigned int*)(0x42A619E4UL)))
#define bM4_DMA1_RPTB2_SRPTB0                     (*((volatile unsigned int*)(0x42A61980UL)))
#define bM4_DMA1_RPTB2_SRPTB1                     (*((volatile unsigned int*)(0x42A61984UL)))
