RT-Thread/rt-thread/bsp/hc32f460/Libraries/CMSIS/Device/HDSC/HC32F460/Include/hc32f460.h
#define bM4_TMR63_PERAR_PERA15                    (*((volatile unsigned int*)(0x423100BCUL)))
#define bM4_TMR63_PERBR_PERB0                     (*((volatile unsigned int*)(0x42310100UL)))
#define bM4_TMR63_PERBR_PERB1                     (*((volatile unsigned int*)(0x42310104UL)))
#define bM4_TMR63_PERBR_PERB2                     (*((volatile unsigned int*)(0x42310108UL)))
#define bM4_TMR63_PERBR_PERB3                     (*((volatile unsigned int*)(0x4231010CUL)))
#define bM4_TMR63_PERBR_PERB4                     (*((volatile unsigned int*)(0x42310110UL)))
#define bM4_TMR63_PERBR_PERB5                     (*((volatile unsigned int*)(0x42310114UL)))
#define bM4_TMR63_PERBR_PERB6                     (*((volatile unsigned int*)(0x42310118UL)))
#define bM4_TMR63_PERBR_PERB7                     (*((volatile unsigned int*)(0x4231011CUL)))
#define bM4_TMR63_PERBR_PERB8                     (*((volatile unsigned int*)(0x42310120UL)))
#define bM4_TMR63_PERBR_PERB9                     (*((volatile unsigned int*)(0x42310124UL)))
#define bM4_TMR63_PERBR_PERB10                    (*((volatile unsigned int*)(0x42310128UL)))
#define bM4_TMR63_PERBR_PERB11                    (*((volatile unsigned int*)(0x4231012CUL)))
#define bM4_TMR63_PERBR_PERB12                    (*((volatile unsigned int*)(0x42310130UL)))
#define bM4_TMR63_PERBR_PERB13                    (*((volatile unsigned int*)(0x42310134UL)))
#define bM4_TMR63_PERBR_PERB14                    (*((volatile unsigned int*)(0x42310138UL)))
#define bM4_TMR63_PERBR_PERB15                    (*((volatile unsigned int*)(0x4231013CUL)))
#define bM4_TMR63_PERCR_PERC0                     (*((volatile unsigned int*)(0x42310180UL)))
#define bM4_TMR63_PERCR_PERC1                     (*((volatile unsigned int*)(0x42310184UL)))
#define bM4_TMR63_PERCR_PERC2                     (*((volatile unsigned int*)(0x42310188UL)))
#define bM4_TMR63_PERCR_PERC3                     (*((volatile unsigned int*)(0x4231018CUL)))
#define bM4_TMR63_PERCR_PERC4                     (*((volatile unsigned int*)(0x42310190UL)))
#define bM4_TMR63_PERCR_PERC5                     (*((volatile unsigned int*)(0x42310194UL)))
#define bM4_TMR63_PERCR_PERC6                     (*((volatile unsigned int*)(0x42310198UL)))
#define bM4_TMR63_PERCR_PERC7                     (*((volatile unsigned int*)(0x4231019CUL)))
#define bM4_TMR63_PERCR_PERC8                     (*((volatile unsigned int*)(0x423101A0UL)))
#define bM4_TMR63_PERCR_PERC9                     (*((volatile unsigned int*)(0x423101A4UL)))
#define bM4_TMR63_PERCR_PERC10                    (*((volatile unsigned int*)(0x423101A8UL)))
#define bM4_TMR63_PERCR_PERC11                    (*((volatile unsigned int*)(0x423101ACUL)))
#define bM4_TMR63_PERCR_PERC12                    (*((volatile unsigned int*)(0x423101B0UL)))
#define bM4_TMR63_PERCR_PERC13                    (*((volatile unsigned int*)(0x423101B4UL)))
#define bM4_TMR63_PERCR_PERC14                    (*((volatile unsigned int*)(0x423101B8UL)))
#define bM4_TMR63_PERCR_PERC15                    (*((volatile unsigned int*)(0x423101BCUL)))
#define bM4_TMR63_GCMAR_GCMA0                     (*((volatile unsigned int*)(0x42310200UL)))
#define bM4_TMR63_GCMAR_GCMA1                     (*((volatile unsigned int*)(0x42310204UL)))
#define bM4_TMR63_GCMAR_GCMA2                     (*((volatile unsigned int*)(0x42310208UL)))
#define bM4_TMR63_GCMAR_GCMA3                     (*((volatile unsigned int*)(0x4231020CUL)))
#define bM4_TMR63_GCMAR_GCMA4                     (*((volatile unsigned int*)(0x42310210UL)))
#define bM4_TMR63_GCMAR_GCMA5                     (*((volatile unsigned int*)(0x42310214UL)))
#define bM4_TMR63_GCMAR_GCMA6                     (*((volatile unsigned int*)(0x42310218UL)))
#define bM4_TMR63_GCMAR_GCMA7                     (*((volatile unsigned int*)(0x4231021CUL)))
#define bM4_TMR63_GCMAR_GCMA8                     (*((volatile unsigned int*)(0x42310220UL)))
#define bM4_TMR63_GCMAR_GCMA9                     (*((volatile unsigned int*)(0x42310224UL)))
#define bM4_TMR63_GCMAR_GCMA10                    (*((volatile unsigned int*)(0x42310228UL)))
#define bM4_TMR63_GCMAR_GCMA11                    (*((volatile unsigned int*)(0x4231022CUL)))
#define bM4_TMR63_GCMAR_GCMA12                    (*((volatile unsigned int*)(0x42310230UL)))
#define bM4_TMR63_GCMAR_GCMA13                    (*((volatile unsigned int*)(0x42310234UL)))
#define bM4_TMR63_GCMAR_GCMA14                    (*((volatile unsigned int*)(0x42310238UL)))
#define bM4_TMR63_GCMAR_GCMA15                    (*((volatile unsigned int*)(0x4231023CUL)))
#define bM4_TMR63_GCMBR_GCMB0                     (*((volatile unsigned int*)(0x42310280UL)))
#define bM4_TMR63_GCMBR_GCMB1                     (*((volatile unsigned int*)(0x42310284UL)))
#define bM4_TMR63_GCMBR_GCMB2                     (*((volatile unsigned int*)(0x42310288UL)))
#define bM4_TMR63_GCMBR_GCMB3                     (*((volatile unsigned int*)(0x4231028CUL)))
#define bM4_TMR63_GCMBR_GCMB4                     (*((volatile unsigned int*)(0x42310290UL)))
#define bM4_TMR63_GCMBR_GCMB5                     (*((volatile unsigned int*)(0x42310294UL)))
#define bM4_TMR63_GCMBR_GCMB6                     (*((volatile unsigned int*)(0x42310298UL)))
#define bM4_TMR63_GCMBR_GCMB7                     (*((volatile unsigned int*)(0x4231029CUL)))
#define bM4_TMR63_GCMBR_GCMB8                     (*((volatile unsigned int*)(0x423102A0UL)))
#define bM4_TMR63_GCMBR_GCMB9                     (*((volatile unsigned int*)(0x423102A4UL)))
#define bM4_TMR63_GCMBR_GCMB10                    (*((volatile unsigned int*)(0x423102A8UL)))
#define bM4_TMR63_GCMBR_GCMB11                    (*((volatile unsigned int*)(0x423102ACUL)))
#define bM4_TMR63_GCMBR_GCMB12                    (*((volatile unsigned int*)(0x423102B0UL)))
#define bM4_TMR63_GCMBR_GCMB13                    (*((volatile unsigned int*)(0x423102B4UL)))
#define bM4_TMR63_GCMBR_GCMB14                    (*((volatile unsigned int*)(0x423102B8UL)))
#define bM4_TMR63_GCMBR_GCMB15                    (*((volatile unsigned int*)(0x423102BCUL)))
#define bM4_TMR63_GCMCR_GCMC0                     (*((volatile unsigned int*)(0x42310300UL)))
#define bM4_TMR63_GCMCR_GCMC1                     (*((volatile unsigned int*)(0x42310304UL)))
#define bM4_TMR63_GCMCR_GCMC2                     (*((volatile unsigned int*)(0x42310308UL)))
#define bM4_TMR63_GCMCR_GCMC3                     (*((volatile unsigned int*)(0x4231030CUL)))
#define bM4_TMR63_GCMCR_GCMC4                     (*((volatile unsigned int*)(0x42310310UL)))
#define bM4_TMR63_GCMCR_GCMC5                     (*((volatile unsigned int*)(0x42310314UL)))
#define bM4_TMR63_GCMCR_GCMC6                     (*((volatile unsigned int*)(0x42310318UL)))
#define bM4_TMR63_GCMCR_GCMC7                     (*((volatile unsigned int*)(0x4231031CUL)))
#define bM4_TMR63_GCMCR_GCMC8                     (*((volatile unsigned int*)(0x42310320UL)))
#define bM4_TMR63_GCMCR_GCMC9                     (*((volatile unsigned int*)(0x42310324UL)))
#define bM4_TMR63_GCMCR_GCMC10                    (*((volatile unsigned int*)(0x42310328UL)))
#define bM4_TMR63_GCMCR_GCMC11                    (*((volatile unsigned int*)(0x4231032CUL)))
#define bM4_TMR63_GCMCR_GCMC12                    (*((volatile unsigned int*)(0x42310330UL)))
#define bM4_TMR63_GCMCR_GCMC13                    (*((volatile unsigned int*)(0x42310334UL)))
#define bM4_TMR63_GCMCR_GCMC14                    (*((volatile unsigned int*)(0x42310338UL)))
#define bM4_TMR63_GCMCR_GCMC15                    (*((volatile unsigned int*)(0x4231033CUL)))
#define bM4_TMR63_GCMDR_GCMD0                     (*((volatile unsigned int*)(0x42310380UL)))
#define bM4_TMR63_GCMDR_GCMD1                     (*((volatile unsigned int*)(0x42310384UL)))
#define bM4_TMR63_GCMDR_GCMD2                     (*((volatile unsigned int*)(0x42310388UL)))
#define bM4_TMR63_GCMDR_GCMD3                     (*((volatile unsigned int*)(0x4231038CUL)))
#define bM4_TMR63_GCMDR_GCMD4                     (*((volatile unsigned int*)(0x42310390UL)))
#define bM4_TMR63_GCMDR_GCMD5                     (*((volatile unsigned int*)(0x42310394UL)))
#define bM4_TMR63_GCMDR_GCMD6                     (*((volatile unsigned int*)(0x42310398UL)))
#define bM4_TMR63_GCMDR_GCMD7                     (*((volatile unsigned int*)(0x4231039CUL)))
#define bM4_TMR63_GCMDR_GCMD8                     (*((volatile unsigned int*)(0x423103A0UL)))
#define bM4_TMR63_GCMDR_GCMD9                     (*((volatile unsigned int*)(0x423103A4UL)))
#define bM4_TMR63_GCMDR_GCMD10                    (*((volatile unsigned int*)(0x423103A8UL)))
#define bM4_TMR63_GCMDR_GCMD11                    (*((volatile unsigned int*)(0x423103ACUL)))
#define bM4_TMR63_GCMDR_GCMD12                    (*((volatile unsigned int*)(0x423103B0UL)))
#define bM4_TMR63_GCMDR_GCMD13                    (*((volatile unsigned int*)(0x423103B4UL)))
#define bM4_TMR63_GCMDR_GCMD14                    (*((volatile unsigned int*)(0x423103B8UL)))
#define bM4_TMR63_GCMDR_GCMD15                    (*((volatile unsigned int*)(0x423103BCUL)))
#define bM4_TMR63_GCMER_GCME0                     (*((volatile unsigned int*)(0x42310400UL)))
#define bM4_TMR63_GCMER_GCME1                     (*((volatile unsigned int*)(0x42310404UL)))
#define bM4_TMR63_GCMER_GCME2                     (*((volatile unsigned int*)(0x42310408UL)))
#define bM4_TMR63_GCMER_GCME3                     (*((volatile unsigned int*)(0x4231040CUL)))
#define bM4_TMR63_GCMER_GCME4                     (*((volatile unsigned int*)(0x42310410UL)))
#define bM4_TMR63_GCMER_GCME5                     (*((volatile unsigned int*)(0x42310414UL)))
#define bM4_TMR63_GCMER_GCME6                     (*((volatile unsigned int*)(0x42310418UL)))
#define bM4_TMR63_GCMER_GCME7                     (*((volatile unsigned int*)(0x4231041CUL)))
#define bM4_TMR63_GCMER_GCME8                     (*((volatile unsigned int*)(0x42310420UL)))
#define bM4_TMR63_GCMER_GCME9                     (*((volatile unsigned int*)(0x42310424UL)))
#define bM4_TMR63_GCMER_GCME10                    (*((volatile unsigned int*)(0x42310428UL)))
#define bM4_TMR63_GCMER_GCME11                    (*((volatile unsigned int*)(0x4231042CUL)))
#define bM4_TMR63_GCMER_GCME12                    (*((volatile unsigned int*)(0x42310430UL)))
#define bM4_TMR63_GCMER_GCME13                    (*((volatile unsigned int*)(0x42310434UL)))
#define bM4_TMR63_GCMER_GCME14                    (*((volatile unsigned int*)(0x42310438UL)))
#define bM4_TMR63_GCMER_GCME15                    (*((volatile unsigned int*)(0x4231043CUL)))
#define bM4_TMR63_GCMFR_GCMF0                     (*((volatile unsigned int*)(0x42310480UL)))
#define bM4_TMR63_GCMFR_GCMF1                     (*((volatile unsigned int*)(0x42310484UL)))
#define bM4_TMR63_GCMFR_GCMF2                     (*((volatile unsigned int*)(0x42310488UL)))
#define bM4_TMR63_GCMFR_GCMF3                     (*((volatile unsigned int*)(0x4231048CUL)))
#define bM4_TMR63_GCMFR_GCMF4                     (*((volatile unsigned int*)(0x42310490UL)))
#define bM4_TMR63_GCMFR_GCMF5                     (*((volatile unsigned int*)(0x42310494UL)))
#define bM4_TMR63_GCMFR_GCMF6                     (*((volatile unsigned int*)(0x42310498UL)))
#define bM4_TMR63_GCMFR_GCMF7                     (*((volatile unsigned int*)(0x4231049CUL)))
#define bM4_TMR63_GCMFR_GCMF8                     (*((volatile unsigned int*)(0x423104A0UL)))
#define bM4_TMR63_GCMFR_GCMF9                     (*((volatile unsigned int*)(0x423104A4UL)))
#define bM4_TMR63_GCMFR_GCMF10                    (*((volatile unsigned int*)(0x423104A8UL)))
#define bM4_TMR63_GCMFR_GCMF11                    (*((volatile unsigned int*)(0x423104ACUL)))
#define bM4_TMR63_GCMFR_GCMF12                    (*((volatile unsigned int*)(0x423104B0UL)))
#define bM4_TMR63_GCMFR_GCMF13                    (*((volatile unsigned int*)(0x423104B4UL)))
#define bM4_TMR63_GCMFR_GCMF14                    (*((volatile unsigned int*)(0x423104B8UL)))
#define bM4_TMR63_GCMFR_GCMF15                    (*((volatile unsigned int*)(0x423104BCUL)))
#define bM4_TMR63_SCMAR_SCMA0                     (*((volatile unsigned int*)(0x42310500UL)))
#define bM4_TMR63_SCMAR_SCMA1                     (*((volatile unsigned int*)(0x42310504UL)))
#define bM4_TMR63_SCMAR_SCMA2                     (*((volatile unsigned int*)(0x42310508UL)))
#define bM4_TMR63_SCMAR_SCMA3                     (*((volatile unsigned int*)(0x4231050CUL)))
#define bM4_TMR63_SCMAR_SCMA4                     (*((volatile unsigned int*)(0x42310510UL)))
#define bM4_TMR63_SCMAR_SCMA5                     (*((volatile unsigned int*)(0x42310514UL)))
#define bM4_TMR63_SCMAR_SCMA6                     (*((volatile unsigned int*)(0x42310518UL)))
#define bM4_TMR63_SCMAR_SCMA7                     (*((volatile unsigned int*)(0x4231051CUL)))
#define bM4_TMR63_SCMAR_SCMA8                     (*((volatile unsigned int*)(0x42310520UL)))
#define bM4_TMR63_SCMAR_SCMA9                     (*((volatile unsigned int*)(0x42310524UL)))
#define bM4_TMR63_SCMAR_SCMA10                    (*((volatile unsigned int*)(0x42310528UL)))
#define bM4_TMR63_SCMAR_SCMA11                    (*((volatile unsigned int*)(0x4231052CUL)))
#define bM4_TMR63_SCMAR_SCMA12                    (*((volatile unsigned int*)(0x42310530UL)))
#define bM4_TMR63_SCMAR_SCMA13                    (*((volatile unsigned int*)(0x42310534UL)))
#define bM4_TMR63_SCMAR_SCMA14                    (*((volatile unsigned int*)(0x42310538UL)))
#define bM4_TMR63_SCMAR_SCMA15                    (*((volatile unsigned int*)(0x4231053CUL)))
#define bM4_TMR63_SCMBR_SCMB0                     (*((volatile unsigned int*)(0x42310580UL)))
#define bM4_TMR63_SCMBR_SCMB1                     (*((volatile unsigned int*)(0x42310584UL)))
#define bM4_TMR63_SCMBR_SCMB2                     (*((volatile unsigned int*)(0x42310588UL)))
#define bM4_TMR63_SCMBR_SCMB3                     (*((volatile unsigned int*)(0x4231058CUL)))
#define bM4_TMR63_SCMBR_SCMB4                     (*((volatile unsigned int*)(0x42310590UL)))
#define bM4_TMR63_SCMBR_SCMB5                     (*((volatile unsigned int*)(0x42310594UL)))
#define bM4_TMR63_SCMBR_SCMB6                     (*((volatile unsigned int*)(0x42310598UL)))
#define bM4_TMR63_SCMBR_SCMB7                     (*((volatile unsigned int*)(0x4231059CUL)))
#define bM4_TMR63_SCMBR_SCMB8                     (*((volatile unsigned int*)(0x423105A0UL)))
#define bM4_TMR63_SCMBR_SCMB9                     (*((volatile unsigned int*)(0x423105A4UL)))
#define bM4_TMR63_SCMBR_SCMB10                    (*((volatile unsigned int*)(0x423105A8UL)))
#define bM4_TMR63_SCMBR_SCMB11                    (*((volatile unsigned int*)(0x423105ACUL)))
#define bM4_TMR63_SCMBR_SCMB12                    (*((volatile unsigned int*)(0x423105B0UL)))
#define bM4_TMR63_SCMBR_SCMB13                    (*((volatile unsigned int*)(0x423105B4UL)))
#define bM4_TMR63_SCMBR_SCMB14                    (*((volatile unsigned int*)(0x423105B8UL)))
#define bM4_TMR63_SCMBR_SCMB15                    (*((volatile unsigned int*)(0x423105BCUL)))
#define bM4_TMR63_SCMCR_SCMC0                     (*((volatile unsigned int*)(0x42310600UL)))
#define bM4_TMR63_SCMCR_SCMC1                     (*((volatile unsigned int*)(0x42310604UL)))
#define bM4_TMR63_SCMCR_SCMC2                     (*((volatile unsigned int*)(0x42310608UL)))
#define bM4_TMR63_SCMCR_SCMC3                     (*((volatile unsigned int*)(0x4231060CUL)))
#define bM4_TMR63_SCMCR_SCMC4                     (*((volatile unsigned int*)(0x42310610UL)))
#define bM4_TMR63_SCMCR_SCMC5                     (*((volatile unsigned int*)(0x42310614UL)))
#define bM4_TMR63_SCMCR_SCMC6                     (*((volatile unsigned int*)(0x42310618UL)))
#define bM4_TMR63_SCMCR_SCMC7                     (*((volatile unsigned int*)(0x4231061CUL)))
#define bM4_TMR63_SCMCR_SCMC8                     (*((volatile unsigned int*)(0x42310620UL)))
#define bM4_TMR63_SCMCR_SCMC9                     (*((volatile unsigned int*)(0x42310624UL)))
#define bM4_TMR63_SCMCR_SCMC10                    (*((volatile unsigned int*)(0x42310628UL)))
#define bM4_TMR63_SCMCR_SCMC11                    (*((volatile unsigned int*)(0x4231062CUL)))
#define bM4_TMR63_SCMCR_SCMC12                    (*((volatile unsigned int*)(0x42310630UL)))
#define bM4_TMR63_SCMCR_SCMC13                    (*((volatile unsigned int*)(0x42310634UL)))
#define bM4_TMR63_SCMCR_SCMC14                    (*((volatile unsigned int*)(0x42310638UL)))
#define bM4_TMR63_SCMCR_SCMC15                    (*((volatile unsigned int*)(0x4231063CUL)))
#define bM4_TMR63_SCMDR_SCMD0                     (*((volatile unsigned int*)(0x42310680UL)))
#define bM4_TMR63_SCMDR_SCMD1                     (*((volatile unsigned int*)(0x42310684UL)))
#define bM4_TMR63_SCMDR_SCMD2                     (*((volatile unsigned int*)(0x42310688UL)))
#define bM4_TMR63_SCMDR_SCMD3                     (*((volatile unsigned int*)(0x4231068CUL)))
#define bM4_TMR63_SCMDR_SCMD4                     (*((volatile unsigned int*)(0x42310690UL)))
#define bM4_TMR63_SCMDR_SCMD5                     (*((volatile unsigned int*)(0x42310694UL)))
#define bM4_TMR63_SCMDR_SCMD6                     (*((volatile unsigned int*)(0x42310698UL)))
#define bM4_TMR63_SCMDR_SCMD7                     (*((volatile unsigned int*)(0x4231069CUL)))
#define bM4_TMR63_SCMDR_SCMD8                     (*((volatile unsigned int*)(0x423106A0UL)))
#define bM4_TMR63_SCMDR_SCMD9                     (*((volatile unsigned int*)(0x423106A4UL)))
#define bM4_TMR63_SCMDR_SCMD10                    (*((volatile unsigned int*)(0x423106A8UL)))
#define bM4_TMR63_SCMDR_SCMD11                    (*((volatile unsigned int*)(0x423106ACUL)))
#define bM4_TMR63_SCMDR_SCMD12                    (*((volatile unsigned int*)(0x423106B0UL)))
#define bM4_TMR63_SCMDR_SCMD13                    (*((volatile unsigned int*)(0x423106B4UL)))
#define bM4_TMR63_SCMDR_SCMD14                    (*((volatile unsigned int*)(0x423106B8UL)))
#define bM4_TMR63_SCMDR_SCMD15                    (*((volatile unsigned int*)(0x423106BCUL)))
#define bM4_TMR63_SCMER_SCME0                     (*((volatile unsigned int*)(0x42310700UL)))
#define bM4_TMR63_SCMER_SCME1                     (*((volatile unsigned int*)(0x42310704UL)))
#define bM4_TMR63_SCMER_SCME2                     (*((volatile unsigned int*)(0x42310708UL)))
#define bM4_TMR63_SCMER_SCME3                     (*((volatile unsigned int*)(0x4231070CUL)))
#define bM4_TMR63_SCMER_SCME4                     (*((volatile unsigned int*)(0x42310710UL)))
#define bM4_TMR63_SCMER_SCME5                     (*((volatile unsigned int*)(0x42310714UL)))
#define bM4_TMR63_SCMER_SCME6                     (*((volatile unsigned int*)(0x42310718UL)))
#define bM4_TMR63_SCMER_SCME7                     (*((volatile unsigned int*)(0x4231071CUL)))
#define bM4_TMR63_SCMER_SCME8                     (*((volatile unsigned int*)(0x42310720UL)))
#define bM4_TMR63_SCMER_SCME9                     (*((volatile unsigned int*)(0x42310724UL)))
#define bM4_TMR63_SCMER_SCME10                    (*((volatile unsigned int*)(0x42310728UL)))
#define bM4_TMR63_SCMER_SCME11                    (*((volatile unsigned int*)(0x4231072CUL)))
#define bM4_TMR63_SCMER_SCME12                    (*((volatile unsigned int*)(0x42310730UL)))
#define bM4_TMR63_SCMER_SCME13                    (*((volatile unsigned int*)(0x42310734UL)))
#define bM4_TMR63_SCMER_SCME14                    (*((volatile unsigned int*)(0x42310738UL)))
#define bM4_TMR63_SCMER_SCME15                    (*((volatile unsigned int*)(0x4231073CUL)))
#define bM4_TMR63_SCMFR_SCMF0                     (*((volatile unsigned int*)(0x42310780UL)))
#define bM4_TMR63_SCMFR_SCMF1                     (*((volatile unsigned int*)(0x42310784UL)))
#define bM4_TMR63_SCMFR_SCMF2                     (*((volatile unsigned int*)(0x42310788UL)))
#define bM4_TMR63_SCMFR_SCMF3                     (*((volatile unsigned int*)(0x4231078CUL)))
#define bM4_TMR63_SCMFR_SCMF4                     (*((volatile unsigned int*)(0x42310790UL)))
#define bM4_TMR63_SCMFR_SCMF5                     (*((volatile unsigned int*)(0x42310794UL)))
#define bM4_TMR63_SCMFR_SCMF6                     (*((volatile unsigned int*)(0x42310798UL)))
#define bM4_TMR63_SCMFR_SCMF7                     (*((volatile unsigned int*)(0x4231079CUL)))
#define bM4_TMR63_SCMFR_SCMF8                     (*((volatile unsigned int*)(0x423107A0UL)))
#define bM4_TMR63_SCMFR_SCMF9                     (*((volatile unsigned int*)(0x423107A4UL)))
#define bM4_TMR63_SCMFR_SCMF10                    (*((volatile unsigned int*)(0x423107A8UL)))
#define bM4_TMR63_SCMFR_SCMF11                    (*((volatile unsigned int*)(0x423107ACUL)))
#define bM4_TMR63_SCMFR_SCMF12                    (*((volatile unsigned int*)(0x423107B0UL)))
#define bM4_TMR63_SCMFR_SCMF13                    (*((volatile unsigned int*)(0x423107B4UL)))
#define bM4_TMR63_SCMFR_SCMF14                    (*((volatile unsigned int*)(0x423107B8UL)))
#define bM4_TMR63_SCMFR_SCMF15                    (*((volatile unsigned int*)(0x423107BCUL)))
#define bM4_TMR63_DTUAR_DTUA0                     (*((volatile unsigned int*)(0x42310800UL)))
#define bM4_TMR63_DTUAR_DTUA1                     (*((volatile unsigned int*)(0x42310804UL)))
#define bM4_TMR63_DTUAR_DTUA2                     (*((volatile unsigned int*)(0x42310808UL)))
#define bM4_TMR63_DTUAR_DTUA3                     (*((volatile unsigned int*)(0x4231080CUL)))
#define bM4_TMR63_DTUAR_DTUA4                     (*((volatile unsigned int*)(0x42310810UL)))
#define bM4_TMR63_DTUAR_DTUA5                     (*((volatile unsigned int*)(0x42310814UL)))
#define bM4_TMR63_DTUAR_DTUA6                     (*((volatile unsigned int*)(0x42310818UL)))
#define bM4_TMR63_DTUAR_DTUA7                     (*((volatile unsigned int*)(0x4231081CUL)))
#define bM4_TMR63_DTUAR_DTUA8                     (*((volatile unsigned int*)(0x42310820UL)))
#define bM4_TMR63_DTUAR_DTUA9                     (*((volatile unsigned int*)(0x42310824UL)))
#define bM4_TMR63_DTUAR_DTUA10                    (*((volatile unsigned int*)(0x42310828UL)))
#define bM4_TMR63_DTUAR_DTUA11                    (*((volatile unsigned int*)(0x4231082CUL)))
#define bM4_TMR63_DTUAR_DTUA12                    (*((volatile unsigned int*)(0x42310830UL)))
#define bM4_TMR63_DTUAR_DTUA13                    (*((volatile unsigned int*)(0x42310834UL)))
#define bM4_TMR63_DTUAR_DTUA14                    (*((volatile unsigned int*)(0x42310838UL)))
#define bM4_TMR63_DTUAR_DTUA15                    (*((volatile unsigned int*)(0x4231083CUL)))
#define bM4_TMR63_DTDAR_DTDA0                     (*((volatile unsigned int*)(0x42310880UL)))
#define bM4_TMR63_DTDAR_DTDA1                     (*((volatile unsigned int*)(0x42310884UL)))
#define bM4_TMR63_DTDAR_DTDA2                     (*((volatile unsigned int*)(0x42310888UL)))
#define bM4_TMR63_DTDAR_DTDA3                     (*((volatile unsigned int*)(0x4231088CUL)))
#define bM4_TMR63_DTDAR_DTDA4                     (*((volatile unsigned int*)(0x42310890UL)))
#define bM4_TMR63_DTDAR_DTDA5                     (*((volatile unsigned int*)(0x42310894UL)))
#define bM4_TMR63_DTDAR_DTDA6                     (*((volatile unsigned int*)(0x42310898UL)))
#define bM4_TMR63_DTDAR_DTDA7                     (*((volatile unsigned int*)(0x4231089CUL)))
#define bM4_TMR63_DTDAR_DTDA8                     (*((volatile unsigned int*)(0x423108A0UL)))
#define bM4_TMR63_DTDAR_DTDA9                     (*((volatile unsigned int*)(0x423108A4UL)))
#define bM4_TMR63_DTDAR_DTDA10                    (*((volatile unsigned int*)(0x423108A8UL)))
#define bM4_TMR63_DTDAR_DTDA11                    (*((volatile unsigned int*)(0x423108ACUL)))
#define bM4_TMR63_DTDAR_DTDA12                    (*((volatile unsigned int*)(0x423108B0UL)))
#define bM4_TMR63_DTDAR_DTDA13                    (*((volatile unsigned int*)(0x423108B4UL)))
