RT-Thread/rt-thread/bsp/hc32f460/Libraries/CMSIS/Device/HDSC/HC32F460/Include/hc32f460.h
#define bM4_TMRA1_PERAR_PER12                     (*((volatile unsigned int*)(0x422A00B0UL)))
#define bM4_TMRA1_PERAR_PER13                     (*((volatile unsigned int*)(0x422A00B4UL)))
#define bM4_TMRA1_PERAR_PER14                     (*((volatile unsigned int*)(0x422A00B8UL)))
#define bM4_TMRA1_PERAR_PER15                     (*((volatile unsigned int*)(0x422A00BCUL)))
#define bM4_TMRA1_CMPAR1_CMP0                     (*((volatile unsigned int*)(0x422A0800UL)))
#define bM4_TMRA1_CMPAR1_CMP1                     (*((volatile unsigned int*)(0x422A0804UL)))
#define bM4_TMRA1_CMPAR1_CMP2                     (*((volatile unsigned int*)(0x422A0808UL)))
#define bM4_TMRA1_CMPAR1_CMP3                     (*((volatile unsigned int*)(0x422A080CUL)))
#define bM4_TMRA1_CMPAR1_CMP4                     (*((volatile unsigned int*)(0x422A0810UL)))
#define bM4_TMRA1_CMPAR1_CMP5                     (*((volatile unsigned int*)(0x422A0814UL)))
#define bM4_TMRA1_CMPAR1_CMP6                     (*((volatile unsigned int*)(0x422A0818UL)))
#define bM4_TMRA1_CMPAR1_CMP7                     (*((volatile unsigned int*)(0x422A081CUL)))
#define bM4_TMRA1_CMPAR1_CMP8                     (*((volatile unsigned int*)(0x422A0820UL)))
#define bM4_TMRA1_CMPAR1_CMP9                     (*((volatile unsigned int*)(0x422A0824UL)))
#define bM4_TMRA1_CMPAR1_CMP10                    (*((volatile unsigned int*)(0x422A0828UL)))
#define bM4_TMRA1_CMPAR1_CMP11                    (*((volatile unsigned int*)(0x422A082CUL)))
#define bM4_TMRA1_CMPAR1_CMP12                    (*((volatile unsigned int*)(0x422A0830UL)))
#define bM4_TMRA1_CMPAR1_CMP13                    (*((volatile unsigned int*)(0x422A0834UL)))
#define bM4_TMRA1_CMPAR1_CMP14                    (*((volatile unsigned int*)(0x422A0838UL)))
#define bM4_TMRA1_CMPAR1_CMP15                    (*((volatile unsigned int*)(0x422A083CUL)))
#define bM4_TMRA1_CMPAR2_CMP0                     (*((volatile unsigned int*)(0x422A0880UL)))
#define bM4_TMRA1_CMPAR2_CMP1                     (*((volatile unsigned int*)(0x422A0884UL)))
#define bM4_TMRA1_CMPAR2_CMP2                     (*((volatile unsigned int*)(0x422A0888UL)))
#define bM4_TMRA1_CMPAR2_CMP3                     (*((volatile unsigned int*)(0x422A088CUL)))
#define bM4_TMRA1_CMPAR2_CMP4                     (*((volatile unsigned int*)(0x422A0890UL)))
#define bM4_TMRA1_CMPAR2_CMP5                     (*((volatile unsigned int*)(0x422A0894UL)))
#define bM4_TMRA1_CMPAR2_CMP6                     (*((volatile unsigned int*)(0x422A0898UL)))
#define bM4_TMRA1_CMPAR2_CMP7                     (*((volatile unsigned int*)(0x422A089CUL)))
#define bM4_TMRA1_CMPAR2_CMP8                     (*((volatile unsigned int*)(0x422A08A0UL)))
#define bM4_TMRA1_CMPAR2_CMP9                     (*((volatile unsigned int*)(0x422A08A4UL)))
#define bM4_TMRA1_CMPAR2_CMP10                    (*((volatile unsigned int*)(0x422A08A8UL)))
#define bM4_TMRA1_CMPAR2_CMP11                    (*((volatile unsigned int*)(0x422A08ACUL)))
#define bM4_TMRA1_CMPAR2_CMP12                    (*((volatile unsigned int*)(0x422A08B0UL)))
#define bM4_TMRA1_CMPAR2_CMP13                    (*((volatile unsigned int*)(0x422A08B4UL)))
#define bM4_TMRA1_CMPAR2_CMP14                    (*((volatile unsigned int*)(0x422A08B8UL)))
#define bM4_TMRA1_CMPAR2_CMP15                    (*((volatile unsigned int*)(0x422A08BCUL)))
#define bM4_TMRA1_CMPAR3_CMP0                     (*((volatile unsigned int*)(0x422A0900UL)))
#define bM4_TMRA1_CMPAR3_CMP1                     (*((volatile unsigned int*)(0x422A0904UL)))
#define bM4_TMRA1_CMPAR3_CMP2                     (*((volatile unsigned int*)(0x422A0908UL)))
#define bM4_TMRA1_CMPAR3_CMP3                     (*((volatile unsigned int*)(0x422A090CUL)))
#define bM4_TMRA1_CMPAR3_CMP4                     (*((volatile unsigned int*)(0x422A0910UL)))
#define bM4_TMRA1_CMPAR3_CMP5                     (*((volatile unsigned int*)(0x422A0914UL)))
#define bM4_TMRA1_CMPAR3_CMP6                     (*((volatile unsigned int*)(0x422A0918UL)))
#define bM4_TMRA1_CMPAR3_CMP7                     (*((volatile unsigned int*)(0x422A091CUL)))
#define bM4_TMRA1_CMPAR3_CMP8                     (*((volatile unsigned int*)(0x422A0920UL)))
#define bM4_TMRA1_CMPAR3_CMP9                     (*((volatile unsigned int*)(0x422A0924UL)))
#define bM4_TMRA1_CMPAR3_CMP10                    (*((volatile unsigned int*)(0x422A0928UL)))
#define bM4_TMRA1_CMPAR3_CMP11                    (*((volatile unsigned int*)(0x422A092CUL)))
#define bM4_TMRA1_CMPAR3_CMP12                    (*((volatile unsigned int*)(0x422A0930UL)))
#define bM4_TMRA1_CMPAR3_CMP13                    (*((volatile unsigned int*)(0x422A0934UL)))
#define bM4_TMRA1_CMPAR3_CMP14                    (*((volatile unsigned int*)(0x422A0938UL)))
#define bM4_TMRA1_CMPAR3_CMP15                    (*((volatile unsigned int*)(0x422A093CUL)))
#define bM4_TMRA1_CMPAR4_CMP0                     (*((volatile unsigned int*)(0x422A0980UL)))
#define bM4_TMRA1_CMPAR4_CMP1                     (*((volatile unsigned int*)(0x422A0984UL)))
#define bM4_TMRA1_CMPAR4_CMP2                     (*((volatile unsigned int*)(0x422A0988UL)))
#define bM4_TMRA1_CMPAR4_CMP3                     (*((volatile unsigned int*)(0x422A098CUL)))
#define bM4_TMRA1_CMPAR4_CMP4                     (*((volatile unsigned int*)(0x422A0990UL)))
#define bM4_TMRA1_CMPAR4_CMP5                     (*((volatile unsigned int*)(0x422A0994UL)))
#define bM4_TMRA1_CMPAR4_CMP6                     (*((volatile unsigned int*)(0x422A0998UL)))
#define bM4_TMRA1_CMPAR4_CMP7                     (*((volatile unsigned int*)(0x422A099CUL)))
#define bM4_TMRA1_CMPAR4_CMP8                     (*((volatile unsigned int*)(0x422A09A0UL)))
#define bM4_TMRA1_CMPAR4_CMP9                     (*((volatile unsigned int*)(0x422A09A4UL)))
#define bM4_TMRA1_CMPAR4_CMP10                    (*((volatile unsigned int*)(0x422A09A8UL)))
#define bM4_TMRA1_CMPAR4_CMP11                    (*((volatile unsigned int*)(0x422A09ACUL)))
#define bM4_TMRA1_CMPAR4_CMP12                    (*((volatile unsigned int*)(0x422A09B0UL)))
#define bM4_TMRA1_CMPAR4_CMP13                    (*((volatile unsigned int*)(0x422A09B4UL)))
#define bM4_TMRA1_CMPAR4_CMP14                    (*((volatile unsigned int*)(0x422A09B8UL)))
#define bM4_TMRA1_CMPAR4_CMP15                    (*((volatile unsigned int*)(0x422A09BCUL)))
#define bM4_TMRA1_CMPAR5_CMP0                     (*((volatile unsigned int*)(0x422A0A00UL)))
#define bM4_TMRA1_CMPAR5_CMP1                     (*((volatile unsigned int*)(0x422A0A04UL)))
#define bM4_TMRA1_CMPAR5_CMP2                     (*((volatile unsigned int*)(0x422A0A08UL)))
#define bM4_TMRA1_CMPAR5_CMP3                     (*((volatile unsigned int*)(0x422A0A0CUL)))
#define bM4_TMRA1_CMPAR5_CMP4                     (*((volatile unsigned int*)(0x422A0A10UL)))
#define bM4_TMRA1_CMPAR5_CMP5                     (*((volatile unsigned int*)(0x422A0A14UL)))
#define bM4_TMRA1_CMPAR5_CMP6                     (*((volatile unsigned int*)(0x422A0A18UL)))
#define bM4_TMRA1_CMPAR5_CMP7                     (*((volatile unsigned int*)(0x422A0A1CUL)))
#define bM4_TMRA1_CMPAR5_CMP8                     (*((volatile unsigned int*)(0x422A0A20UL)))
#define bM4_TMRA1_CMPAR5_CMP9                     (*((volatile unsigned int*)(0x422A0A24UL)))
#define bM4_TMRA1_CMPAR5_CMP10                    (*((volatile unsigned int*)(0x422A0A28UL)))
#define bM4_TMRA1_CMPAR5_CMP11                    (*((volatile unsigned int*)(0x422A0A2CUL)))
#define bM4_TMRA1_CMPAR5_CMP12                    (*((volatile unsigned int*)(0x422A0A30UL)))
#define bM4_TMRA1_CMPAR5_CMP13                    (*((volatile unsigned int*)(0x422A0A34UL)))
#define bM4_TMRA1_CMPAR5_CMP14                    (*((volatile unsigned int*)(0x422A0A38UL)))
#define bM4_TMRA1_CMPAR5_CMP15                    (*((volatile unsigned int*)(0x422A0A3CUL)))
#define bM4_TMRA1_CMPAR6_CMP0                     (*((volatile unsigned int*)(0x422A0A80UL)))
#define bM4_TMRA1_CMPAR6_CMP1                     (*((volatile unsigned int*)(0x422A0A84UL)))
#define bM4_TMRA1_CMPAR6_CMP2                     (*((volatile unsigned int*)(0x422A0A88UL)))
#define bM4_TMRA1_CMPAR6_CMP3                     (*((volatile unsigned int*)(0x422A0A8CUL)))
#define bM4_TMRA1_CMPAR6_CMP4                     (*((volatile unsigned int*)(0x422A0A90UL)))
#define bM4_TMRA1_CMPAR6_CMP5                     (*((volatile unsigned int*)(0x422A0A94UL)))
#define bM4_TMRA1_CMPAR6_CMP6                     (*((volatile unsigned int*)(0x422A0A98UL)))
#define bM4_TMRA1_CMPAR6_CMP7                     (*((volatile unsigned int*)(0x422A0A9CUL)))
#define bM4_TMRA1_CMPAR6_CMP8                     (*((volatile unsigned int*)(0x422A0AA0UL)))
#define bM4_TMRA1_CMPAR6_CMP9                     (*((volatile unsigned int*)(0x422A0AA4UL)))
#define bM4_TMRA1_CMPAR6_CMP10                    (*((volatile unsigned int*)(0x422A0AA8UL)))
#define bM4_TMRA1_CMPAR6_CMP11                    (*((volatile unsigned int*)(0x422A0AACUL)))
#define bM4_TMRA1_CMPAR6_CMP12                    (*((volatile unsigned int*)(0x422A0AB0UL)))
#define bM4_TMRA1_CMPAR6_CMP13                    (*((volatile unsigned int*)(0x422A0AB4UL)))
#define bM4_TMRA1_CMPAR6_CMP14                    (*((volatile unsigned int*)(0x422A0AB8UL)))
#define bM4_TMRA1_CMPAR6_CMP15                    (*((volatile unsigned int*)(0x422A0ABCUL)))
#define bM4_TMRA1_CMPAR7_CMP0                     (*((volatile unsigned int*)(0x422A0B00UL)))
#define bM4_TMRA1_CMPAR7_CMP1                     (*((volatile unsigned int*)(0x422A0B04UL)))
#define bM4_TMRA1_CMPAR7_CMP2                     (*((volatile unsigned int*)(0x422A0B08UL)))
#define bM4_TMRA1_CMPAR7_CMP3                     (*((volatile unsigned int*)(0x422A0B0CUL)))
#define bM4_TMRA1_CMPAR7_CMP4                     (*((volatile unsigned int*)(0x422A0B10UL)))
#define bM4_TMRA1_CMPAR7_CMP5                     (*((volatile unsigned int*)(0x422A0B14UL)))
#define bM4_TMRA1_CMPAR7_CMP6                     (*((volatile unsigned int*)(0x422A0B18UL)))
#define bM4_TMRA1_CMPAR7_CMP7                     (*((volatile unsigned int*)(0x422A0B1CUL)))
#define bM4_TMRA1_CMPAR7_CMP8                     (*((volatile unsigned int*)(0x422A0B20UL)))
#define bM4_TMRA1_CMPAR7_CMP9                     (*((volatile unsigned int*)(0x422A0B24UL)))
#define bM4_TMRA1_CMPAR7_CMP10                    (*((volatile unsigned int*)(0x422A0B28UL)))
#define bM4_TMRA1_CMPAR7_CMP11                    (*((volatile unsigned int*)(0x422A0B2CUL)))
#define bM4_TMRA1_CMPAR7_CMP12                    (*((volatile unsigned int*)(0x422A0B30UL)))
#define bM4_TMRA1_CMPAR7_CMP13                    (*((volatile unsigned int*)(0x422A0B34UL)))
#define bM4_TMRA1_CMPAR7_CMP14                    (*((volatile unsigned int*)(0x422A0B38UL)))
#define bM4_TMRA1_CMPAR7_CMP15                    (*((volatile unsigned int*)(0x422A0B3CUL)))
#define bM4_TMRA1_CMPAR8_CMP0                     (*((volatile unsigned int*)(0x422A0B80UL)))
#define bM4_TMRA1_CMPAR8_CMP1                     (*((volatile unsigned int*)(0x422A0B84UL)))
#define bM4_TMRA1_CMPAR8_CMP2                     (*((volatile unsigned int*)(0x422A0B88UL)))
#define bM4_TMRA1_CMPAR8_CMP3                     (*((volatile unsigned int*)(0x422A0B8CUL)))
#define bM4_TMRA1_CMPAR8_CMP4                     (*((volatile unsigned int*)(0x422A0B90UL)))
#define bM4_TMRA1_CMPAR8_CMP5                     (*((volatile unsigned int*)(0x422A0B94UL)))
#define bM4_TMRA1_CMPAR8_CMP6                     (*((volatile unsigned int*)(0x422A0B98UL)))
#define bM4_TMRA1_CMPAR8_CMP7                     (*((volatile unsigned int*)(0x422A0B9CUL)))
#define bM4_TMRA1_CMPAR8_CMP8                     (*((volatile unsigned int*)(0x422A0BA0UL)))
#define bM4_TMRA1_CMPAR8_CMP9                     (*((volatile unsigned int*)(0x422A0BA4UL)))
#define bM4_TMRA1_CMPAR8_CMP10                    (*((volatile unsigned int*)(0x422A0BA8UL)))
#define bM4_TMRA1_CMPAR8_CMP11                    (*((volatile unsigned int*)(0x422A0BACUL)))
#define bM4_TMRA1_CMPAR8_CMP12                    (*((volatile unsigned int*)(0x422A0BB0UL)))
#define bM4_TMRA1_CMPAR8_CMP13                    (*((volatile unsigned int*)(0x422A0BB4UL)))
#define bM4_TMRA1_CMPAR8_CMP14                    (*((volatile unsigned int*)(0x422A0BB8UL)))
#define bM4_TMRA1_CMPAR8_CMP15                    (*((volatile unsigned int*)(0x422A0BBCUL)))
#define bM4_TMRA1_BCSTR_START                     (*((volatile unsigned int*)(0x422A1000UL)))
#define bM4_TMRA1_BCSTR_DIR                       (*((volatile unsigned int*)(0x422A1004UL)))
#define bM4_TMRA1_BCSTR_MODE                      (*((volatile unsigned int*)(0x422A1008UL)))
#define bM4_TMRA1_BCSTR_SYNST                     (*((volatile unsigned int*)(0x422A100CUL)))
#define bM4_TMRA1_BCSTR_CKDIV0                    (*((volatile unsigned int*)(0x422A1010UL)))
#define bM4_TMRA1_BCSTR_CKDIV1                    (*((volatile unsigned int*)(0x422A1014UL)))
#define bM4_TMRA1_BCSTR_CKDIV2                    (*((volatile unsigned int*)(0x422A1018UL)))
#define bM4_TMRA1_BCSTR_CKDIV3                    (*((volatile unsigned int*)(0x422A101CUL)))
#define bM4_TMRA1_BCSTR_ITENOVF                   (*((volatile unsigned int*)(0x422A1030UL)))
#define bM4_TMRA1_BCSTR_ITENUDF                   (*((volatile unsigned int*)(0x422A1034UL)))
#define bM4_TMRA1_BCSTR_OVFF                      (*((volatile unsigned int*)(0x422A1038UL)))
#define bM4_TMRA1_BCSTR_UDFF                      (*((volatile unsigned int*)(0x422A103CUL)))
#define bM4_TMRA1_HCONR_HSTA0                     (*((volatile unsigned int*)(0x422A1080UL)))
#define bM4_TMRA1_HCONR_HSTA1                     (*((volatile unsigned int*)(0x422A1084UL)))
#define bM4_TMRA1_HCONR_HSTA2                     (*((volatile unsigned int*)(0x422A1088UL)))
#define bM4_TMRA1_HCONR_HSTP0                     (*((volatile unsigned int*)(0x422A1090UL)))
#define bM4_TMRA1_HCONR_HSTP1                     (*((volatile unsigned int*)(0x422A1094UL)))
#define bM4_TMRA1_HCONR_HSTP2                     (*((volatile unsigned int*)(0x422A1098UL)))
#define bM4_TMRA1_HCONR_HCLE0                     (*((volatile unsigned int*)(0x422A10A0UL)))
#define bM4_TMRA1_HCONR_HCLE1                     (*((volatile unsigned int*)(0x422A10A4UL)))
#define bM4_TMRA1_HCONR_HCLE2                     (*((volatile unsigned int*)(0x422A10A8UL)))
#define bM4_TMRA1_HCONR_HCLE3                     (*((volatile unsigned int*)(0x422A10B0UL)))
#define bM4_TMRA1_HCONR_HCLE4                     (*((volatile unsigned int*)(0x422A10B4UL)))
#define bM4_TMRA1_HCONR_HCLE5                     (*((volatile unsigned int*)(0x422A10B8UL)))
#define bM4_TMRA1_HCONR_HCLE6                     (*((volatile unsigned int*)(0x422A10BCUL)))
#define bM4_TMRA1_HCUPR_HCUP0                     (*((volatile unsigned int*)(0x422A1100UL)))
#define bM4_TMRA1_HCUPR_HCUP1                     (*((volatile unsigned int*)(0x422A1104UL)))
#define bM4_TMRA1_HCUPR_HCUP2                     (*((volatile unsigned int*)(0x422A1108UL)))
#define bM4_TMRA1_HCUPR_HCUP3                     (*((volatile unsigned int*)(0x422A110CUL)))
#define bM4_TMRA1_HCUPR_HCUP4                     (*((volatile unsigned int*)(0x422A1110UL)))
#define bM4_TMRA1_HCUPR_HCUP5                     (*((volatile unsigned int*)(0x422A1114UL)))
#define bM4_TMRA1_HCUPR_HCUP6                     (*((volatile unsigned int*)(0x422A1118UL)))
#define bM4_TMRA1_HCUPR_HCUP7                     (*((volatile unsigned int*)(0x422A111CUL)))
#define bM4_TMRA1_HCUPR_HCUP8                     (*((volatile unsigned int*)(0x422A1120UL)))
#define bM4_TMRA1_HCUPR_HCUP9                     (*((volatile unsigned int*)(0x422A1124UL)))
#define bM4_TMRA1_HCUPR_HCUP10                    (*((volatile unsigned int*)(0x422A1128UL)))
#define bM4_TMRA1_HCUPR_HCUP11                    (*((volatile unsigned int*)(0x422A112CUL)))
#define bM4_TMRA1_HCUPR_HCUP12                    (*((volatile unsigned int*)(0x422A1130UL)))
#define bM4_TMRA1_HCDOR_HCDO0                     (*((volatile unsigned int*)(0x422A1180UL)))
#define bM4_TMRA1_HCDOR_HCDO1                     (*((volatile unsigned int*)(0x422A1184UL)))
#define bM4_TMRA1_HCDOR_HCDO2                     (*((volatile unsigned int*)(0x422A1188UL)))
#define bM4_TMRA1_HCDOR_HCDO3                     (*((volatile unsigned int*)(0x422A118CUL)))
#define bM4_TMRA1_HCDOR_HCDO4                     (*((volatile unsigned int*)(0x422A1190UL)))
#define bM4_TMRA1_HCDOR_HCDO5                     (*((volatile unsigned int*)(0x422A1194UL)))
#define bM4_TMRA1_HCDOR_HCDO6                     (*((volatile unsigned int*)(0x422A1198UL)))
#define bM4_TMRA1_HCDOR_HCDO7                     (*((volatile unsigned int*)(0x422A119CUL)))
#define bM4_TMRA1_HCDOR_HCDO8                     (*((volatile unsigned int*)(0x422A11A0UL)))
#define bM4_TMRA1_HCDOR_HCDO9                     (*((volatile unsigned int*)(0x422A11A4UL)))
#define bM4_TMRA1_HCDOR_HCDO10                    (*((volatile unsigned int*)(0x422A11A8UL)))
#define bM4_TMRA1_HCDOR_HCDO11                    (*((volatile unsigned int*)(0x422A11ACUL)))
#define bM4_TMRA1_HCDOR_HCDO12                    (*((volatile unsigned int*)(0x422A11B0UL)))
#define bM4_TMRA1_ICONR_ITEN1                     (*((volatile unsigned int*)(0x422A1200UL)))
#define bM4_TMRA1_ICONR_ITEN2                     (*((volatile unsigned int*)(0x422A1204UL)))
#define bM4_TMRA1_ICONR_ITEN3                     (*((volatile unsigned int*)(0x422A1208UL)))
#define bM4_TMRA1_ICONR_ITEN4                     (*((volatile unsigned int*)(0x422A120CUL)))
#define bM4_TMRA1_ICONR_ITEN5                     (*((volatile unsigned int*)(0x422A1210UL)))
#define bM4_TMRA1_ICONR_ITEN6                     (*((volatile unsigned int*)(0x422A1214UL)))
#define bM4_TMRA1_ICONR_ITEN7                     (*((volatile unsigned int*)(0x422A1218UL)))
#define bM4_TMRA1_ICONR_ITEN8                     (*((volatile unsigned int*)(0x422A121CUL)))
#define bM4_TMRA1_ECONR_ETEN1                     (*((volatile unsigned int*)(0x422A1280UL)))
#define bM4_TMRA1_ECONR_ETEN2                     (*((volatile unsigned int*)(0x422A1284UL)))
#define bM4_TMRA1_ECONR_ETEN3                     (*((volatile unsigned int*)(0x422A1288UL)))
#define bM4_TMRA1_ECONR_ETEN4                     (*((volatile unsigned int*)(0x422A128CUL)))
#define bM4_TMRA1_ECONR_ETEN5                     (*((volatile unsigned int*)(0x422A1290UL)))
#define bM4_TMRA1_ECONR_ETEN6                     (*((volatile unsigned int*)(0x422A1294UL)))
#define bM4_TMRA1_ECONR_ETEN7                     (*((volatile unsigned int*)(0x422A1298UL)))
#define bM4_TMRA1_ECONR_ETEN8                     (*((volatile unsigned int*)(0x422A129CUL)))
#define bM4_TMRA1_FCONR_NOFIENTG                  (*((volatile unsigned int*)(0x422A1300UL)))
#define bM4_TMRA1_FCONR_NOFICKTG0                 (*((volatile unsigned int*)(0x422A1304UL)))
#define bM4_TMRA1_FCONR_NOFICKTG1                 (*((volatile unsigned int*)(0x422A1308UL)))
#define bM4_TMRA1_FCONR_NOFIENCA                  (*((volatile unsigned int*)(0x422A1320UL)))
#define bM4_TMRA1_FCONR_NOFICKCA0                 (*((volatile unsigned int*)(0x422A1324UL)))
#define bM4_TMRA1_FCONR_NOFICKCA1                 (*((volatile unsigned int*)(0x422A1328UL)))
#define bM4_TMRA1_FCONR_NOFIENCB                  (*((volatile unsigned int*)(0x422A1330UL)))
#define bM4_TMRA1_FCONR_NOFICKCB0                 (*((volatile unsigned int*)(0x422A1334UL)))
#define bM4_TMRA1_FCONR_NOFICKCB1                 (*((volatile unsigned int*)(0x422A1338UL)))
#define bM4_TMRA1_STFLR_CMPF1                     (*((volatile unsigned int*)(0x422A1380UL)))
#define bM4_TMRA1_STFLR_CMPF2                     (*((volatile unsigned int*)(0x422A1384UL)))
#define bM4_TMRA1_STFLR_CMPF3                     (*((volatile unsigned int*)(0x422A1388UL)))
#define bM4_TMRA1_STFLR_CMPF4                     (*((volatile unsigned int*)(0x422A138CUL)))
#define bM4_TMRA1_STFLR_CMPF5                     (*((volatile unsigned int*)(0x422A1390UL)))
#define bM4_TMRA1_STFLR_CMPF6                     (*((volatile unsigned int*)(0x422A1394UL)))
#define bM4_TMRA1_STFLR_CMPF7                     (*((volatile unsigned int*)(0x422A1398UL)))
#define bM4_TMRA1_STFLR_CMPF8                     (*((volatile unsigned int*)(0x422A139CUL)))
#define bM4_TMRA1_BCONR1_BEN                      (*((volatile unsigned int*)(0x422A1800UL)))
#define bM4_TMRA1_BCONR1_BSE0                     (*((volatile unsigned int*)(0x422A1804UL)))
#define bM4_TMRA1_BCONR1_BSE1                     (*((volatile unsigned int*)(0x422A1808UL)))
#define bM4_TMRA1_BCONR2_BEN                      (*((volatile unsigned int*)(0x422A1900UL)))
#define bM4_TMRA1_BCONR2_BSE0                     (*((volatile unsigned int*)(0x422A1904UL)))
#define bM4_TMRA1_BCONR2_BSE1                     (*((volatile unsigned int*)(0x422A1908UL)))
#define bM4_TMRA1_BCONR3_BEN                      (*((volatile unsigned int*)(0x422A1A00UL)))
#define bM4_TMRA1_BCONR3_BSE0                     (*((volatile unsigned int*)(0x422A1A04UL)))
#define bM4_TMRA1_BCONR3_BSE1                     (*((volatile unsigned int*)(0x422A1A08UL)))
#define bM4_TMRA1_BCONR4_BEN                      (*((volatile unsigned int*)(0x422A1B00UL)))
#define bM4_TMRA1_BCONR4_BSE0                     (*((volatile unsigned int*)(0x422A1B04UL)))
#define bM4_TMRA1_BCONR4_BSE1                     (*((volatile unsigned int*)(0x422A1B08UL)))
#define bM4_TMRA1_CCONR1_CAPMD                    (*((volatile unsigned int*)(0x422A2000UL)))
#define bM4_TMRA1_CCONR1_HICP0                    (*((volatile unsigned int*)(0x422A2010UL)))
#define bM4_TMRA1_CCONR1_HICP1                    (*((volatile unsigned int*)(0x422A2014UL)))
#define bM4_TMRA1_CCONR1_HICP2                    (*((volatile unsigned int*)(0x422A2018UL)))
#define bM4_TMRA1_CCONR1_HICP3                    (*((volatile unsigned int*)(0x422A2020UL)))
#define bM4_TMRA1_CCONR1_HICP4                    (*((volatile unsigned int*)(0x422A2024UL)))
#define bM4_TMRA1_CCONR1_NOFIENCP                 (*((volatile unsigned int*)(0x422A2030UL)))
#define bM4_TMRA1_CCONR1_NOFICKCP0                (*((volatile unsigned int*)(0x422A2034UL)))
#define bM4_TMRA1_CCONR1_NOFICKCP1                (*((volatile unsigned int*)(0x422A2038UL)))
#define bM4_TMRA1_CCONR2_CAPMD                    (*((volatile unsigned int*)(0x422A2080UL)))
#define bM4_TMRA1_CCONR2_HICP0                    (*((volatile unsigned int*)(0x422A2090UL)))
#define bM4_TMRA1_CCONR2_HICP1                    (*((volatile unsigned int*)(0x422A2094UL)))
#define bM4_TMRA1_CCONR2_HICP2                    (*((volatile unsigned int*)(0x422A2098UL)))
#define bM4_TMRA1_CCONR2_HICP3                    (*((volatile unsigned int*)(0x422A20A0UL)))
#define bM4_TMRA1_CCONR2_HICP4                    (*((volatile unsigned int*)(0x422A20A4UL)))
#define bM4_TMRA1_CCONR2_NOFIENCP                 (*((volatile unsigned int*)(0x422A20B0UL)))
#define bM4_TMRA1_CCONR2_NOFICKCP0                (*((volatile unsigned int*)(0x422A20B4UL)))
#define bM4_TMRA1_CCONR2_NOFICKCP1                (*((volatile unsigned int*)(0x422A20B8UL)))
#define bM4_TMRA1_CCONR3_CAPMD                    (*((volatile unsigned int*)(0x422A2100UL)))
#define bM4_TMRA1_CCONR3_HICP0                    (*((volatile unsigned int*)(0x422A2110UL)))
#define bM4_TMRA1_CCONR3_HICP1                    (*((volatile unsigned int*)(0x422A2114UL)))
#define bM4_TMRA1_CCONR3_HICP2                    (*((volatile unsigned int*)(0x422A2118UL)))
#define bM4_TMRA1_CCONR3_HICP3                    (*((volatile unsigned int*)(0x422A2120UL)))
#define bM4_TMRA1_CCONR3_HICP4                    (*((volatile unsigned int*)(0x422A2124UL)))
#define bM4_TMRA1_CCONR3_NOFIENCP                 (*((volatile unsigned int*)(0x422A2130UL)))
#define bM4_TMRA1_CCONR3_NOFICKCP0                (*((volatile unsigned int*)(0x422A2134UL)))
#define bM4_TMRA1_CCONR3_NOFICKCP1                (*((volatile unsigned int*)(0x422A2138UL)))
